RT-Thread-Studio/sdk-bsp-psoc_e84-edgi-talk/projects/Edgi_Talk_M55_Driver_All/packages/lsm6ds3tr/lsm6ds3tr-c_reg.h
#define LSM6DS3TR_C_CTRL7_G                      0x16U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t not_used_01              : 2;
    uint8_t rounding_status          : 1;
    uint8_t not_used_02              : 1;
    uint8_t hpm_g                    : 2;
    uint8_t hp_en_g                  : 1;
    uint8_t g_hm_mode                : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
    uint8_t g_hm_mode                : 1;
    uint8_t hp_en_g                  : 1;
    uint8_t hpm_g                    : 2;
    uint8_t not_used_02              : 1;
    uint8_t rounding_status          : 1;
    uint8_t not_used_01              : 2;
#endif /* DRV_BYTE_ORDER */
} lsm6ds3tr_c_ctrl7_g_t;

#define LSM6DS3TR_C_CTRL8_XL                     0x17U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t low_pass_on_6d           : 1;
    uint8_t not_used_01              : 1;
    uint8_t hp_slope_xl_en           : 1;
    uint8_t input_composite          : 1;
    uint8_t hp_ref_mode              : 1;
    uint8_t hpcf_xl                  : 2;
    uint8_t lpf2_xl_en               : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
    uint8_t lpf2_xl_en               : 1;
    uint8_t hpcf_xl                  : 2;
    uint8_t hp_ref_mode              : 1;
    uint8_t input_composite          : 1;
    uint8_t hp_slope_xl_en           : 1;
    uint8_t not_used_01              : 1;
    uint8_t low_pass_on_6d           : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6ds3tr_c_ctrl8_xl_t;

#define LSM6DS3TR_C_CTRL9_XL                     0x18U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t not_used_01              : 2;
    uint8_t soft_en                  : 1;
    uint8_t not_used_02              : 1;
    uint8_t den_xl_g                 : 1;
    uint8_t den_z                    : 1;
    uint8_t den_y                    : 1;
    uint8_t den_x                    : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
    uint8_t den_x                    : 1;
    uint8_t den_y                    : 1;
    uint8_t den_z                    : 1;
    uint8_t den_xl_g                 : 1;
    uint8_t not_used_02              : 1;
    uint8_t soft_en                  : 1;
    uint8_t not_used_01              : 2;
#endif /* DRV_BYTE_ORDER */
} lsm6ds3tr_c_ctrl9_xl_t;

#define LSM6DS3TR_C_CTRL10_C                     0x19U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t sign_motion_en           : 1;
    uint8_t pedo_rst_step            : 1;
    uint8_t func_en                  : 1;
    uint8_t tilt_en                  : 1;
    uint8_t pedo_en                  : 1;
    uint8_t timer_en                 : 1;
    uint8_t not_used_01              : 1;
    uint8_t wrist_tilt_en            : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
    uint8_t wrist_tilt_en            : 1;
    uint8_t not_used_01              : 1;
    uint8_t timer_en                 : 1;
    uint8_t pedo_en                  : 1;
    uint8_t tilt_en                  : 1;
    uint8_t func_en                  : 1;
    uint8_t pedo_rst_step            : 1;
    uint8_t sign_motion_en           : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6ds3tr_c_ctrl10_c_t;

#define LSM6DS3TR_C_MASTER_CONFIG                0x1AU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t master_on                : 1;
    uint8_t iron_en                  : 1;
    uint8_t pass_through_mode        : 1;
    uint8_t pull_up_en               : 1;
    uint8_t start_config             : 1;
    uint8_t not_used_01              : 1;
    uint8_t data_valid_sel_fifo      : 1;
    uint8_t drdy_on_int1             : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
    uint8_t drdy_on_int1             : 1;
    uint8_t data_valid_sel_fifo      : 1;
    uint8_t not_used_01              : 1;
    uint8_t start_config             : 1;
    uint8_t pull_up_en               : 1;
    uint8_t pass_through_mode        : 1;
    uint8_t iron_en                  : 1;
    uint8_t master_on                : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6ds3tr_c_master_config_t;

#define LSM6DS3TR_C_WAKE_UP_SRC                  0x1BU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t z_wu                     : 1;
    uint8_t y_wu                     : 1;
    uint8_t x_wu                     : 1;
    uint8_t wu_ia                    : 1;
    uint8_t sleep_state_ia           : 1;
    uint8_t ff_ia                    : 1;
    uint8_t not_used_01              : 2;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
    uint8_t not_used_01              : 2;
    uint8_t ff_ia                    : 1;
    uint8_t sleep_state_ia           : 1;
    uint8_t wu_ia                    : 1;
    uint8_t x_wu                     : 1;
    uint8_t y_wu                     : 1;
    uint8_t z_wu                     : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6ds3tr_c_wake_up_src_t;

#define LSM6DS3TR_C_TAP_SRC                      0x1CU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t z_tap                    : 1;
    uint8_t y_tap                    : 1;
    uint8_t x_tap                    : 1;
    uint8_t tap_sign                 : 1;
    uint8_t double_tap               : 1;
    uint8_t single_tap               : 1;
    uint8_t tap_ia                   : 1;
    uint8_t not_used_01              : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
    uint8_t not_used_01              : 1;
    uint8_t tap_ia                   : 1;
    uint8_t single_tap               : 1;
    uint8_t double_tap               : 1;
    uint8_t tap_sign                 : 1;
    uint8_t x_tap                    : 1;
    uint8_t y_tap                    : 1;
    uint8_t z_tap                    : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6ds3tr_c_tap_src_t;

#define LSM6DS3TR_C_D6D_SRC                      0x1DU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t xl                       : 1;
    uint8_t xh                       : 1;
    uint8_t yl                       : 1;
    uint8_t yh                       : 1;
    uint8_t zl                       : 1;
    uint8_t zh                       : 1;
    uint8_t d6d_ia                   : 1;
    uint8_t den_drdy                 : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
    uint8_t den_drdy                 : 1;
    uint8_t d6d_ia                   : 1;
    uint8_t zh                       : 1;
    uint8_t zl                       : 1;
    uint8_t yh                       : 1;
    uint8_t yl                       : 1;
    uint8_t xh                       : 1;
    uint8_t xl                       : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6ds3tr_c_d6d_src_t;

