RT-Thread-Studio/sdk-bsp-psoc_e84-edgi-talk/projects/Edgi_Talk_M55_Driver_All/packages/lsm6ds3tr/lsm6ds3tr-c_reg.h
#define LSM6DS3TR_C_STATUS_REG                   0x1EU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t xlda                     : 1;
    uint8_t gda                      : 1;
    uint8_t tda                      : 1;
    uint8_t not_used_01              : 5;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
    uint8_t not_used_01              : 5;
    uint8_t tda                      : 1;
    uint8_t gda                      : 1;
    uint8_t xlda                     : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6ds3tr_c_status_reg_t;

#define LSM6DS3TR_C_OUT_TEMP_L                   0x20U
#define LSM6DS3TR_C_OUT_TEMP_H                   0x21U
#define LSM6DS3TR_C_OUTX_L_G                     0x22U
#define LSM6DS3TR_C_OUTX_H_G                     0x23U
#define LSM6DS3TR_C_OUTY_L_G                     0x24U
#define LSM6DS3TR_C_OUTY_H_G                     0x25U
#define LSM6DS3TR_C_OUTZ_L_G                     0x26U
#define LSM6DS3TR_C_OUTZ_H_G                     0x27U
#define LSM6DS3TR_C_OUTX_L_XL                    0x28U
#define LSM6DS3TR_C_OUTX_H_XL                    0x29U
#define LSM6DS3TR_C_OUTY_L_XL                    0x2AU
#define LSM6DS3TR_C_OUTY_H_XL                    0x2BU
#define LSM6DS3TR_C_OUTZ_L_XL                    0x2CU
#define LSM6DS3TR_C_OUTZ_H_XL                    0x2DU
#define LSM6DS3TR_C_SENSORHUB1_REG               0x2EU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t bit0                     : 1;
    uint8_t bit1                     : 1;
    uint8_t bit2                     : 1;
    uint8_t bit3                     : 1;
    uint8_t bit4                     : 1;
    uint8_t bit5                     : 1;
    uint8_t bit6                     : 1;
    uint8_t bit7                     : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
    uint8_t bit7                     : 1;
    uint8_t bit6                     : 1;
    uint8_t bit5                     : 1;
    uint8_t bit4                     : 1;
    uint8_t bit3                     : 1;
    uint8_t bit2                     : 1;
    uint8_t bit1                     : 1;
    uint8_t bit0                     : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6ds3tr_c_sensorhub1_reg_t;

#define LSM6DS3TR_C_SENSORHUB2_REG               0x2FU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t bit0                     : 1;
    uint8_t bit1                     : 1;
    uint8_t bit2                     : 1;
    uint8_t bit3                     : 1;
    uint8_t bit4                     : 1;
    uint8_t bit5                     : 1;
    uint8_t bit6                     : 1;
    uint8_t bit7                     : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
    uint8_t bit7                     : 1;
    uint8_t bit6                     : 1;
    uint8_t bit5                     : 1;
    uint8_t bit4                     : 1;
    uint8_t bit3                     : 1;
    uint8_t bit2                     : 1;
    uint8_t bit1                     : 1;
    uint8_t bit0                     : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6ds3tr_c_sensorhub2_reg_t;

#define LSM6DS3TR_C_SENSORHUB3_REG               0x30U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t bit0                     : 1;
    uint8_t bit1                     : 1;
    uint8_t bit2                     : 1;
    uint8_t bit3                     : 1;
    uint8_t bit4                     : 1;
    uint8_t bit5                     : 1;
    uint8_t bit6                     : 1;
    uint8_t bit7                     : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
    uint8_t bit7                     : 1;
    uint8_t bit6                     : 1;
    uint8_t bit5                     : 1;
    uint8_t bit4                     : 1;
    uint8_t bit3                     : 1;
    uint8_t bit2                     : 1;
    uint8_t bit1                     : 1;
    uint8_t bit0                     : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6ds3tr_c_sensorhub3_reg_t;

#define LSM6DS3TR_C_SENSORHUB4_REG               0x31U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t bit0                     : 1;
    uint8_t bit1                     : 1;
    uint8_t bit2                     : 1;
    uint8_t bit3                     : 1;
    uint8_t bit4                     : 1;
    uint8_t bit5                     : 1;
    uint8_t bit6                     : 1;
    uint8_t bit7                     : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
    uint8_t bit7                     : 1;
    uint8_t bit6                     : 1;
    uint8_t bit5                     : 1;
    uint8_t bit4                     : 1;
    uint8_t bit3                     : 1;
    uint8_t bit2                     : 1;
    uint8_t bit1                     : 1;
    uint8_t bit0                     : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6ds3tr_c_sensorhub4_reg_t;

#define LSM6DS3TR_C_SENSORHUB5_REG               0x32U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t bit0                     : 1;
    uint8_t bit1                     : 1;
    uint8_t bit2                     : 1;
    uint8_t bit3                     : 1;
    uint8_t bit4                     : 1;
    uint8_t bit5                     : 1;
    uint8_t bit6                     : 1;
    uint8_t bit7                     : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
    uint8_t bit7                     : 1;
    uint8_t bit6                     : 1;
    uint8_t bit5                     : 1;
    uint8_t bit4                     : 1;
    uint8_t bit3                     : 1;
    uint8_t bit2                     : 1;
    uint8_t bit1                     : 1;
    uint8_t bit0                     : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6ds3tr_c_sensorhub5_reg_t;

#define LSM6DS3TR_C_SENSORHUB6_REG               0x33U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t bit0                     : 1;
    uint8_t bit1                     : 1;
    uint8_t bit2                     : 1;
    uint8_t bit3                     : 1;
    uint8_t bit4                     : 1;
    uint8_t bit5                     : 1;
    uint8_t bit6                     : 1;
    uint8_t bit7                     : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
    uint8_t bit7                     : 1;
    uint8_t bit6                     : 1;
    uint8_t bit5                     : 1;
    uint8_t bit4                     : 1;
    uint8_t bit3                     : 1;
    uint8_t bit2                     : 1;
    uint8_t bit1                     : 1;
    uint8_t bit0                     : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6ds3tr_c_sensorhub6_reg_t;

#define LSM6DS3TR_C_SENSORHUB7_REG               0x34U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t bit0                     : 1;
    uint8_t bit1                     : 1;
    uint8_t bit2                     : 1;
    uint8_t bit3                     : 1;
    uint8_t bit4                     : 1;
    uint8_t bit5                     : 1;
    uint8_t bit6                     : 1;
    uint8_t bit7                     : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
    uint8_t bit7                     : 1;
    uint8_t bit6                     : 1;
    uint8_t bit5                     : 1;
    uint8_t bit4                     : 1;
    uint8_t bit3                     : 1;
    uint8_t bit2                     : 1;
    uint8_t bit1                     : 1;
    uint8_t bit0                     : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6ds3tr_c_sensorhub7_reg_t;

