RT-Thread-Studio/sdk-bsp-psoc_e84-edgi-talk/projects/Edgi_Talk_M55_Driver_All/packages/lsm6ds3tr/lsm6ds3tr-c_reg.h
#define LSM6DS3TR_C_SENSORHUB8_REG               0x35U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t bit0                     : 1;
    uint8_t bit1                     : 1;
    uint8_t bit2                     : 1;
    uint8_t bit3                     : 1;
    uint8_t bit4                     : 1;
    uint8_t bit5                     : 1;
    uint8_t bit6                     : 1;
    uint8_t bit7                     : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
    uint8_t bit7                     : 1;
    uint8_t bit6                     : 1;
    uint8_t bit5                     : 1;
    uint8_t bit4                     : 1;
    uint8_t bit3                     : 1;
    uint8_t bit2                     : 1;
    uint8_t bit1                     : 1;
    uint8_t bit0                     : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6ds3tr_c_sensorhub8_reg_t;

#define LSM6DS3TR_C_SENSORHUB9_REG               0x36U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t bit0                     : 1;
    uint8_t bit1                     : 1;
    uint8_t bit2                     : 1;
    uint8_t bit3                     : 1;
    uint8_t bit4                     : 1;
    uint8_t bit5                     : 1;
    uint8_t bit6                     : 1;
    uint8_t bit7                     : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
    uint8_t bit7                     : 1;
    uint8_t bit6                     : 1;
    uint8_t bit5                     : 1;
    uint8_t bit4                     : 1;
    uint8_t bit3                     : 1;
    uint8_t bit2                     : 1;
    uint8_t bit1                     : 1;
    uint8_t bit0                     : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6ds3tr_c_sensorhub9_reg_t;

#define LSM6DS3TR_C_SENSORHUB10_REG              0x37U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t bit0                     : 1;
    uint8_t bit1                     : 1;
    uint8_t bit2                     : 1;
    uint8_t bit3                     : 1;
    uint8_t bit4                     : 1;
    uint8_t bit5                     : 1;
    uint8_t bit6                     : 1;
    uint8_t bit7                     : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
    uint8_t bit7                     : 1;
    uint8_t bit6                     : 1;
    uint8_t bit5                     : 1;
    uint8_t bit4                     : 1;
    uint8_t bit3                     : 1;
    uint8_t bit2                     : 1;
    uint8_t bit1                     : 1;
    uint8_t bit0                     : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6ds3tr_c_sensorhub10_reg_t;

#define LSM6DS3TR_C_SENSORHUB11_REG              0x38U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t bit0                     : 1;
    uint8_t bit1                     : 1;
    uint8_t bit2                     : 1;
    uint8_t bit3                     : 1;
    uint8_t bit4                     : 1;
    uint8_t bit5                     : 1;
    uint8_t bit6                     : 1;
    uint8_t bit7                     : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
    uint8_t bit7                     : 1;
    uint8_t bit6                     : 1;
    uint8_t bit5                     : 1;
    uint8_t bit4                     : 1;
    uint8_t bit3                     : 1;
    uint8_t bit2                     : 1;
    uint8_t bit1                     : 1;
    uint8_t bit0                     : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6ds3tr_c_sensorhub11_reg_t;

#define LSM6DS3TR_C_SENSORHUB12_REG              0x39U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t bit0                     : 1;
    uint8_t bit1                     : 1;
    uint8_t bit2                     : 1;
    uint8_t bit3                     : 1;
    uint8_t bit4                     : 1;
    uint8_t bit5                     : 1;
    uint8_t bit6                     : 1;
    uint8_t bit7                     : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
    uint8_t bit7                     : 1;
    uint8_t bit6                     : 1;
    uint8_t bit5                     : 1;
    uint8_t bit4                     : 1;
    uint8_t bit3                     : 1;
    uint8_t bit2                     : 1;
    uint8_t bit1                     : 1;
    uint8_t bit0                     : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6ds3tr_c_sensorhub12_reg_t;

#define LSM6DS3TR_C_FIFO_STATUS1                 0x3AU
typedef struct
{
    uint8_t diff_fifo                : 8;  /* + FIFO_STATUS2(diff_fifo) */
} lsm6ds3tr_c_fifo_status1_t;

#define LSM6DS3TR_C_FIFO_STATUS2                 0x3BU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t diff_fifo                : 3;  /* + FIFO_STATUS1(diff_fifo) */
    uint8_t not_used_01              : 1;
    uint8_t fifo_empty               : 1;
    uint8_t fifo_full_smart          : 1;
    uint8_t over_run                 : 1;
    uint8_t waterm                   : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
    uint8_t waterm                   : 1;
    uint8_t over_run                 : 1;
    uint8_t fifo_full_smart          : 1;
    uint8_t fifo_empty               : 1;
    uint8_t not_used_01              : 1;
    uint8_t diff_fifo                : 3;  /* + FIFO_STATUS1(diff_fifo) */
#endif /* DRV_BYTE_ORDER */
} lsm6ds3tr_c_fifo_status2_t;

#define LSM6DS3TR_C_FIFO_STATUS3                 0x3CU
typedef struct
{
    uint8_t fifo_pattern             : 8;  /* + FIFO_STATUS4(fifo_pattern) */
} lsm6ds3tr_c_fifo_status3_t;

#define LSM6DS3TR_C_FIFO_STATUS4                 0x3DU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t fifo_pattern             : 2;  /* + FIFO_STATUS3(fifo_pattern) */
    uint8_t not_used_01              : 6;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
    uint8_t not_used_01              : 6;
    uint8_t fifo_pattern             : 2;  /* + FIFO_STATUS3(fifo_pattern) */
#endif /* DRV_BYTE_ORDER */
} lsm6ds3tr_c_fifo_status4_t;

#define LSM6DS3TR_C_FIFO_DATA_OUT_L              0x3EU
#define LSM6DS3TR_C_FIFO_DATA_OUT_H              0x3FU
#define LSM6DS3TR_C_TIMESTAMP0_REG               0x40U
#define LSM6DS3TR_C_TIMESTAMP1_REG               0x41U
#define LSM6DS3TR_C_TIMESTAMP2_REG               0x42U
#define LSM6DS3TR_C_STEP_TIMESTAMP_L             0x49U
#define LSM6DS3TR_C_STEP_TIMESTAMP_H             0x4AU
#define LSM6DS3TR_C_STEP_COUNTER_L               0x4BU
#define LSM6DS3TR_C_STEP_COUNTER_H               0x4CU

#define LSM6DS3TR_C_SENSORHUB13_REG              0x4DU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t bit0                     : 1;
    uint8_t bit1                     : 1;
    uint8_t bit2                     : 1;
    uint8_t bit3                     : 1;
    uint8_t bit4                     : 1;
    uint8_t bit5                     : 1;
    uint8_t bit6                     : 1;
    uint8_t bit7                     : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
    uint8_t bit7                     : 1;
    uint8_t bit6                     : 1;
    uint8_t bit5                     : 1;
    uint8_t bit4                     : 1;
    uint8_t bit3                     : 1;
    uint8_t bit2                     : 1;
    uint8_t bit1                     : 1;
    uint8_t bit0                     : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6ds3tr_c_sensorhub13_reg_t;

