RT-Thread-Studio/sdk-bsp-psoc_e84-edgi-talk/projects/Edgi_Talk_M55_Driver_All/packages/lsm6ds3tr/lsm6ds3tr-c_reg.h
#define LSM6DS3TR_C_SENSORHUB14_REG              0x4EU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t bit0                     : 1;
    uint8_t bit1                     : 1;
    uint8_t bit2                     : 1;
    uint8_t bit3                     : 1;
    uint8_t bit4                     : 1;
    uint8_t bit5                     : 1;
    uint8_t bit6                     : 1;
    uint8_t bit7                     : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
    uint8_t bit7                     : 1;
    uint8_t bit6                     : 1;
    uint8_t bit5                     : 1;
    uint8_t bit4                     : 1;
    uint8_t bit3                     : 1;
    uint8_t bit2                     : 1;
    uint8_t bit1                     : 1;
    uint8_t bit0                     : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6ds3tr_c_sensorhub14_reg_t;

#define LSM6DS3TR_C_SENSORHUB15_REG              0x4FU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t bit0                     : 1;
    uint8_t bit1                     : 1;
    uint8_t bit2                     : 1;
    uint8_t bit3                     : 1;
    uint8_t bit4                     : 1;
    uint8_t bit5                     : 1;
    uint8_t bit6                     : 1;
    uint8_t bit7                     : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
    uint8_t bit7                     : 1;
    uint8_t bit6                     : 1;
    uint8_t bit5                     : 1;
    uint8_t bit4                     : 1;
    uint8_t bit3                     : 1;
    uint8_t bit2                     : 1;
    uint8_t bit1                     : 1;
    uint8_t bit0                     : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6ds3tr_c_sensorhub15_reg_t;

#define LSM6DS3TR_C_SENSORHUB16_REG              0x50U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t bit0                     : 1;
    uint8_t bit1                     : 1;
    uint8_t bit2                     : 1;
    uint8_t bit3                     : 1;
    uint8_t bit4                     : 1;
    uint8_t bit5                     : 1;
    uint8_t bit6                     : 1;
    uint8_t bit7                     : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
    uint8_t bit7                     : 1;
    uint8_t bit6                     : 1;
    uint8_t bit5                     : 1;
    uint8_t bit4                     : 1;
    uint8_t bit3                     : 1;
    uint8_t bit2                     : 1;
    uint8_t bit1                     : 1;
    uint8_t bit0                     : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6ds3tr_c_sensorhub16_reg_t;

#define LSM6DS3TR_C_SENSORHUB17_REG              0x51U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t bit0                     : 1;
    uint8_t bit1                     : 1;
    uint8_t bit2                     : 1;
    uint8_t bit3                     : 1;
    uint8_t bit4                     : 1;
    uint8_t bit5                     : 1;
    uint8_t bit6                     : 1;
    uint8_t bit7                     : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
    uint8_t bit7                     : 1;
    uint8_t bit6                     : 1;
    uint8_t bit5                     : 1;
    uint8_t bit4                     : 1;
    uint8_t bit3                     : 1;
    uint8_t bit2                     : 1;
    uint8_t bit1                     : 1;
    uint8_t bit0                     : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6ds3tr_c_sensorhub17_reg_t;

#define LSM6DS3TR_C_SENSORHUB18_REG              0x52U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t bit0                     : 1;
    uint8_t bit1                     : 1;
    uint8_t bit2                     : 1;
    uint8_t bit3                     : 1;
    uint8_t bit4                     : 1;
    uint8_t bit5                     : 1;
    uint8_t bit6                     : 1;
    uint8_t bit7                     : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
    uint8_t bit7                     : 1;
    uint8_t bit6                     : 1;
    uint8_t bit5                     : 1;
    uint8_t bit4                     : 1;
    uint8_t bit3                     : 1;
    uint8_t bit2                     : 1;
    uint8_t bit1                     : 1;
    uint8_t bit0                     : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6ds3tr_c_sensorhub18_reg_t;

#define LSM6DS3TR_C_FUNC_SRC1                    0x53U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t sensorhub_end_op         : 1;
    uint8_t si_end_op                : 1;
    uint8_t hi_fail                  : 1;
    uint8_t step_overflow            : 1;
    uint8_t step_detected            : 1;
    uint8_t tilt_ia                  : 1;
    uint8_t sign_motion_ia           : 1;
    uint8_t step_count_delta_ia      : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
    uint8_t step_count_delta_ia      : 1;
    uint8_t sign_motion_ia           : 1;
    uint8_t tilt_ia                  : 1;
    uint8_t step_detected            : 1;
    uint8_t step_overflow            : 1;
    uint8_t hi_fail                  : 1;
    uint8_t si_end_op                : 1;
    uint8_t sensorhub_end_op         : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6ds3tr_c_func_src1_t;

#define LSM6DS3TR_C_FUNC_SRC2                    0x54U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t wrist_tilt_ia            : 1;
    uint8_t not_used_01              : 2;
    uint8_t slave0_nack              : 1;
    uint8_t slave1_nack              : 1;
    uint8_t slave2_nack              : 1;
    uint8_t slave3_nack              : 1;
    uint8_t not_used_02              : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
    uint8_t not_used_02              : 1;
    uint8_t slave3_nack              : 1;
    uint8_t slave2_nack              : 1;
    uint8_t slave1_nack              : 1;
    uint8_t slave0_nack              : 1;
    uint8_t not_used_01              : 2;
    uint8_t wrist_tilt_ia            : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6ds3tr_c_func_src2_t;

