RT-Thread-Studio/sdk-bsp-psoc_e84-edgi-talk/projects/Edgi_Talk_M55_Driver_All/packages/lsm6ds3tr/lsm6ds3tr-c_reg.h
#define LSM6DS3TR_C_SLV0_SUBADD                  0x03U
typedef struct
{
    uint8_t slave0_reg               : 8;
} lsm6ds3tr_c_slv0_subadd_t;

#define LSM6DS3TR_C_SLAVE0_CONFIG                0x04U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t slave0_numop             : 3;
    uint8_t src_mode                 : 1;
    uint8_t aux_sens_on              : 2;
    uint8_t slave0_rate              : 2;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
    uint8_t slave0_rate              : 2;
    uint8_t aux_sens_on              : 2;
    uint8_t src_mode                 : 1;
    uint8_t slave0_numop             : 3;
#endif /* DRV_BYTE_ORDER */
} lsm6ds3tr_c_slave0_config_t;

#define LSM6DS3TR_C_SLV1_ADD                     0x05U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t r_1                      : 1;
    uint8_t slave1_add               : 7;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
    uint8_t slave1_add               : 7;
    uint8_t r_1                      : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6ds3tr_c_slv1_add_t;

#define LSM6DS3TR_C_SLV1_SUBADD                  0x06U
typedef struct
{
    uint8_t slave1_reg               : 8;
} lsm6ds3tr_c_slv1_subadd_t;

#define LSM6DS3TR_C_SLAVE1_CONFIG                0x07U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t slave1_numop             : 3;
    uint8_t not_used_01              : 2;
    uint8_t write_once               : 1;
    uint8_t slave1_rate              : 2;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
    uint8_t slave1_rate              : 2;
    uint8_t write_once               : 1;
    uint8_t not_used_01              : 2;
    uint8_t slave1_numop             : 3;
#endif /* DRV_BYTE_ORDER */
} lsm6ds3tr_c_slave1_config_t;

#define LSM6DS3TR_C_SLV2_ADD                     0x08U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t r_2                      : 1;
    uint8_t slave2_add               : 7;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
    uint8_t slave2_add               : 7;
    uint8_t r_2                      : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6ds3tr_c_slv2_add_t;

#define LSM6DS3TR_C_SLV2_SUBADD                  0x09U
typedef struct
{
    uint8_t slave2_reg               : 8;
} lsm6ds3tr_c_slv2_subadd_t;

#define LSM6DS3TR_C_SLAVE2_CONFIG                0x0AU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t slave2_numop             : 3;
    uint8_t not_used_01              : 3;
    uint8_t slave2_rate              : 2;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
    uint8_t slave2_rate              : 2;
    uint8_t not_used_01              : 3;
    uint8_t slave2_numop             : 3;
#endif /* DRV_BYTE_ORDER */
} lsm6ds3tr_c_slave2_config_t;

#define LSM6DS3TR_C_SLV3_ADD                     0x0BU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t r_3                      : 1;
    uint8_t slave3_add               : 7;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
    uint8_t slave3_add               : 7;
    uint8_t r_3                      : 1;
#endif /* DRV_BYTE_ORDER */
} lsm6ds3tr_c_slv3_add_t;

#define LSM6DS3TR_C_SLV3_SUBADD                  0x0CU
typedef struct
{
    uint8_t slave3_reg               : 8;
} lsm6ds3tr_c_slv3_subadd_t;

#define LSM6DS3TR_C_SLAVE3_CONFIG                0x0DU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t slave3_numop             : 3;
    uint8_t not_used_01              : 3;
    uint8_t slave3_rate              : 2;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
    uint8_t slave3_rate              : 2;
    uint8_t not_used_01              : 3;
    uint8_t slave3_numop             : 3;
#endif /* DRV_BYTE_ORDER */
} lsm6ds3tr_c_slave3_config_t;

#define LSM6DS3TR_C_DATAWRITE_SRC_MODE_SUB_SLV0  0x0EU
typedef struct
{
    uint8_t slave_dataw              : 8;
} lsm6ds3tr_c_datawrite_src_mode_sub_slv0_t;

#define LSM6DS3TR_C_CONFIG_PEDO_THS_MIN          0x0FU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t ths_min                  : 5;
    uint8_t not_used_01              : 2;
    uint8_t pedo_fs                  : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
    uint8_t pedo_fs                  : 1;
    uint8_t not_used_01              : 2;
    uint8_t ths_min                  : 5;
#endif /* DRV_BYTE_ORDER */
} lsm6ds3tr_c_config_pedo_ths_min_t;

#define LSM6DS3TR_C_SM_THS                       0x13U
#define LSM6DS3TR_C_PEDO_DEB_REG                 0x14U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t deb_step      : 3;
    uint8_t deb_time      : 5;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
    uint8_t deb_time      : 5;
    uint8_t deb_step      : 3;
#endif /* DRV_BYTE_ORDER */
} lsm6ds3tr_c_pedo_deb_reg_t;

#define LSM6DS3TR_C_STEP_COUNT_DELTA             0x15U
#define LSM6DS3TR_C_MAG_SI_XX                    0x24U
#define LSM6DS3TR_C_MAG_SI_XY                    0x25U
#define LSM6DS3TR_C_MAG_SI_XZ                    0x26U
#define LSM6DS3TR_C_MAG_SI_YX                    0x27U
#define LSM6DS3TR_C_MAG_SI_YY                    0x28U
#define LSM6DS3TR_C_MAG_SI_YZ                    0x29U
#define LSM6DS3TR_C_MAG_SI_ZX                    0x2AU
#define LSM6DS3TR_C_MAG_SI_ZY                    0x2BU
#define LSM6DS3TR_C_MAG_SI_ZZ                    0x2CU
#define LSM6DS3TR_C_MAG_OFFX_L                   0x2DU
#define LSM6DS3TR_C_MAG_OFFX_H                   0x2EU
#define LSM6DS3TR_C_MAG_OFFY_L                   0x2FU
#define LSM6DS3TR_C_MAG_OFFY_H                   0x30U
#define LSM6DS3TR_C_MAG_OFFZ_L                   0x31U
#define LSM6DS3TR_C_MAG_OFFZ_H                   0x32U
#define LSM6DS3TR_C_A_WRIST_TILT_LAT             0x50U
#define LSM6DS3TR_C_A_WRIST_TILT_THS             0x54U
#define LSM6DS3TR_C_A_WRIST_TILT_MASK            0x59U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
    uint8_t not_used_01              : 2;
    uint8_t  wrist_tilt_mask_zneg    : 1;
    uint8_t  wrist_tilt_mask_zpos    : 1;
    uint8_t  wrist_tilt_mask_yneg    : 1;
    uint8_t  wrist_tilt_mask_ypos    : 1;
    uint8_t  wrist_tilt_mask_xneg    : 1;
    uint8_t  wrist_tilt_mask_xpos    : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
    uint8_t  wrist_tilt_mask_xpos    : 1;
    uint8_t  wrist_tilt_mask_xneg    : 1;
    uint8_t  wrist_tilt_mask_ypos    : 1;
    uint8_t  wrist_tilt_mask_yneg    : 1;
    uint8_t  wrist_tilt_mask_zpos    : 1;
    uint8_t  wrist_tilt_mask_zneg    : 1;
    uint8_t not_used_01              : 2;
#endif /* DRV_BYTE_ORDER */
} lsm6ds3tr_c_a_wrist_tilt_mask_t;

/**
  * @defgroup LSM6DS3TR_C_Register_Union
  * @brief    This union group all the registers having a bit-field
  *           description.
  *           This union is useful but it's not needed by the driver.
  *
  *           REMOVING this union you are compliant with:
  *           MISRA-C 2012 [Rule 19.2] -> " Union are not allowed "
  *
  * @{
  *
  */
typedef union
{
    lsm6ds3tr_c_func_cfg_access_t                  func_cfg_access;
    lsm6ds3tr_c_sensor_sync_time_frame_t           sensor_sync_time_frame;
    lsm6ds3tr_c_sensor_sync_res_ratio_t            sensor_sync_res_ratio;
    lsm6ds3tr_c_fifo_ctrl1_t                       fifo_ctrl1;
    lsm6ds3tr_c_fifo_ctrl2_t                       fifo_ctrl2;
    lsm6ds3tr_c_fifo_ctrl3_t                       fifo_ctrl3;
    lsm6ds3tr_c_fifo_ctrl4_t                       fifo_ctrl4;
    lsm6ds3tr_c_fifo_ctrl5_t                       fifo_ctrl5;
    lsm6ds3tr_c_drdy_pulse_cfg_g_t                 drdy_pulse_cfg_g;
    lsm6ds3tr_c_int1_ctrl_t                        int1_ctrl;
    lsm6ds3tr_c_int2_ctrl_t                        int2_ctrl;
    lsm6ds3tr_c_ctrl1_xl_t                         ctrl1_xl;
    lsm6ds3tr_c_ctrl2_g_t                          ctrl2_g;
    lsm6ds3tr_c_ctrl3_c_t                          ctrl3_c;
    lsm6ds3tr_c_ctrl4_c_t                          ctrl4_c;
    lsm6ds3tr_c_ctrl5_c_t                          ctrl5_c;
    lsm6ds3tr_c_ctrl6_c_t                          ctrl6_c;
    lsm6ds3tr_c_ctrl7_g_t                          ctrl7_g;
    lsm6ds3tr_c_ctrl8_xl_t                         ctrl8_xl;
    lsm6ds3tr_c_ctrl9_xl_t                         ctrl9_xl;
    lsm6ds3tr_c_ctrl10_c_t                         ctrl10_c;
    lsm6ds3tr_c_master_config_t                    master_config;
    lsm6ds3tr_c_wake_up_src_t                      wake_up_src;
    lsm6ds3tr_c_tap_src_t                          tap_src;
    lsm6ds3tr_c_d6d_src_t                          d6d_src;
    lsm6ds3tr_c_status_reg_t                       status_reg;
    lsm6ds3tr_c_sensorhub1_reg_t                   sensorhub1_reg;
    lsm6ds3tr_c_sensorhub2_reg_t                   sensorhub2_reg;
    lsm6ds3tr_c_sensorhub3_reg_t                   sensorhub3_reg;
    lsm6ds3tr_c_sensorhub4_reg_t                   sensorhub4_reg;
    lsm6ds3tr_c_sensorhub5_reg_t                   sensorhub5_reg;
    lsm6ds3tr_c_sensorhub6_reg_t                   sensorhub6_reg;
    lsm6ds3tr_c_sensorhub7_reg_t                   sensorhub7_reg;
    lsm6ds3tr_c_sensorhub8_reg_t                   sensorhub8_reg;
    lsm6ds3tr_c_sensorhub9_reg_t                   sensorhub9_reg;
    lsm6ds3tr_c_sensorhub10_reg_t                  sensorhub10_reg;
    lsm6ds3tr_c_sensorhub11_reg_t                  sensorhub11_reg;
    lsm6ds3tr_c_sensorhub12_reg_t                  sensorhub12_reg;
    lsm6ds3tr_c_fifo_status1_t                     fifo_status1;
    lsm6ds3tr_c_fifo_status2_t                     fifo_status2;
    lsm6ds3tr_c_fifo_status3_t                     fifo_status3;
    lsm6ds3tr_c_fifo_status4_t                     fifo_status4;
    lsm6ds3tr_c_sensorhub13_reg_t                  sensorhub13_reg;
    lsm6ds3tr_c_sensorhub14_reg_t                  sensorhub14_reg;
    lsm6ds3tr_c_sensorhub15_reg_t                  sensorhub15_reg;
    lsm6ds3tr_c_sensorhub16_reg_t                  sensorhub16_reg;
    lsm6ds3tr_c_sensorhub17_reg_t                  sensorhub17_reg;
    lsm6ds3tr_c_sensorhub18_reg_t                  sensorhub18_reg;
    lsm6ds3tr_c_func_src1_t                        func_src1;
    lsm6ds3tr_c_func_src2_t                        func_src2;
    lsm6ds3tr_c_wrist_tilt_ia_t                    wrist_tilt_ia;
    lsm6ds3tr_c_tap_cfg_t                          tap_cfg;
    lsm6ds3tr_c_tap_ths_6d_t                       tap_ths_6d;
    lsm6ds3tr_c_int_dur2_t                         int_dur2;
    lsm6ds3tr_c_wake_up_ths_t                      wake_up_ths;
    lsm6ds3tr_c_wake_up_dur_t                      wake_up_dur;
    lsm6ds3tr_c_free_fall_t                        free_fall;
    lsm6ds3tr_c_md1_cfg_t                          md1_cfg;
    lsm6ds3tr_c_md2_cfg_t                          md2_cfg;
    lsm6ds3tr_c_master_cmd_code_t                  master_cmd_code;
    lsm6ds3tr_c_sens_sync_spi_error_code_t
    sens_sync_spi_error_code;
    lsm6ds3tr_c_slv0_add_t                         slv0_add;
    lsm6ds3tr_c_slv0_subadd_t                      slv0_subadd;
    lsm6ds3tr_c_slave0_config_t                    slave0_config;
    lsm6ds3tr_c_slv1_add_t                         slv1_add;
    lsm6ds3tr_c_slv1_subadd_t                      slv1_subadd;
    lsm6ds3tr_c_slave1_config_t                    slave1_config;
    lsm6ds3tr_c_slv2_add_t                         slv2_add;
    lsm6ds3tr_c_slv2_subadd_t                      slv2_subadd;
    lsm6ds3tr_c_slave2_config_t                    slave2_config;
    lsm6ds3tr_c_slv3_add_t                         slv3_add;
    lsm6ds3tr_c_slv3_subadd_t                      slv3_subadd;
    lsm6ds3tr_c_slave3_config_t                    slave3_config;
    lsm6ds3tr_c_datawrite_src_mode_sub_slv0_t
    datawrite_src_mode_sub_slv0;
    lsm6ds3tr_c_config_pedo_ths_min_t              config_pedo_ths_min;
    lsm6ds3tr_c_pedo_deb_reg_t                     pedo_deb_reg;
    lsm6ds3tr_c_a_wrist_tilt_mask_t                a_wrist_tilt_mask;
    bitwise_t                                  bitwise;
    uint8_t                                    byte;
} lsm6ds3tr_c_reg_t;

/**
  * @}
  *
  */

#ifndef __weak
#define __weak __attribute__((weak))
#endif /* __weak */

