RT-Thread-Studio/sdk-bsp-psoc_e84-edgi-talk/projects/Edgi_Talk_M55_Driver_All/packages/lsm6ds3tr/lsm6ds3tr-c_reg.h
/*
 * These are the basic platform dependent I/O routines to read
 * and write device registers connected on a standard bus.
 * The driver keeps offering a default implementation based on function
 * pointers to read/write routines for backward compatibility.
 * The __weak directive allows the final application to overwrite
 * them with a custom implementation.
 */

int32_t lsm6ds3tr_c_read_reg(const stmdev_ctx_t *ctx, uint8_t reg,
                             uint8_t *data,
                             uint16_t len);
int32_t lsm6ds3tr_c_write_reg(const stmdev_ctx_t *ctx, uint8_t reg,
                              uint8_t *data,
                              uint16_t len);

float lsm6ds3tr_c_from_fs2g_to_mg(int16_t lsb);
float lsm6ds3tr_c_from_fs4g_to_mg(int16_t lsb);
float lsm6ds3tr_c_from_fs8g_to_mg(int16_t lsb);
float lsm6ds3tr_c_from_fs16g_to_mg(int16_t lsb);

float lsm6ds3tr_c_from_fs125dps_to_mdps(int16_t lsb);
float lsm6ds3tr_c_from_fs250dps_to_mdps(int16_t lsb);
float lsm6ds3tr_c_from_fs500dps_to_mdps(int16_t lsb);
float lsm6ds3tr_c_from_fs1000dps_to_mdps(int16_t lsb);
float lsm6ds3tr_c_from_fs2000dps_to_mdps(int16_t lsb);

float lsm6ds3tr_c_from_lsb_to_celsius(int16_t lsb);

typedef enum
{
    LSM6DS3TR_C_2g       = 0,
    LSM6DS3TR_C_16g      = 1,
    LSM6DS3TR_C_4g       = 2,
    LSM6DS3TR_C_8g       = 3,
    LSM6DS3TR_C_XL_FS_ND = 4,  /* ERROR CODE */
} lsm6ds3tr_c_fs_xl_t;
int32_t lsm6ds3tr_c_xl_full_scale_set(const stmdev_ctx_t *ctx,
                                      lsm6ds3tr_c_fs_xl_t val);
int32_t lsm6ds3tr_c_xl_full_scale_get(const stmdev_ctx_t *ctx,
                                      lsm6ds3tr_c_fs_xl_t *val);

typedef enum
{
    LSM6DS3TR_C_XL_ODR_OFF      =  0,
    LSM6DS3TR_C_XL_ODR_12Hz5    =  1,
    LSM6DS3TR_C_XL_ODR_26Hz     =  2,
    LSM6DS3TR_C_XL_ODR_52Hz     =  3,
    LSM6DS3TR_C_XL_ODR_104Hz    =  4,
    LSM6DS3TR_C_XL_ODR_208Hz    =  5,
    LSM6DS3TR_C_XL_ODR_416Hz    =  6,
    LSM6DS3TR_C_XL_ODR_833Hz    =  7,
    LSM6DS3TR_C_XL_ODR_1k66Hz   =  8,
    LSM6DS3TR_C_XL_ODR_3k33Hz   =  9,
    LSM6DS3TR_C_XL_ODR_6k66Hz   = 10,
    LSM6DS3TR_C_XL_ODR_1Hz6     = 11,
    LSM6DS3TR_C_XL_ODR_ND       = 12,  /* ERROR CODE */
} lsm6ds3tr_c_odr_xl_t;
int32_t lsm6ds3tr_c_xl_data_rate_set(const stmdev_ctx_t *ctx,
                                     lsm6ds3tr_c_odr_xl_t val);
int32_t lsm6ds3tr_c_xl_data_rate_get(const stmdev_ctx_t *ctx,
                                     lsm6ds3tr_c_odr_xl_t *val);

typedef enum
{
    LSM6DS3TR_C_250dps     = 0,
    LSM6DS3TR_C_125dps     = 1,
    LSM6DS3TR_C_500dps     = 2,
    LSM6DS3TR_C_1000dps    = 4,
    LSM6DS3TR_C_2000dps    = 6,
    LSM6DS3TR_C_GY_FS_ND   = 7,    /* ERROR CODE */
} lsm6ds3tr_c_fs_g_t;
int32_t lsm6ds3tr_c_gy_full_scale_set(const stmdev_ctx_t *ctx,
                                      lsm6ds3tr_c_fs_g_t val);
int32_t lsm6ds3tr_c_gy_full_scale_get(const stmdev_ctx_t *ctx,
                                      lsm6ds3tr_c_fs_g_t *val);

typedef enum
{
    LSM6DS3TR_C_GY_ODR_OFF    =  0,
    LSM6DS3TR_C_GY_ODR_12Hz5  =  1,
    LSM6DS3TR_C_GY_ODR_26Hz   =  2,
    LSM6DS3TR_C_GY_ODR_52Hz   =  3,
    LSM6DS3TR_C_GY_ODR_104Hz  =  4,
    LSM6DS3TR_C_GY_ODR_208Hz  =  5,
    LSM6DS3TR_C_GY_ODR_416Hz  =  6,
    LSM6DS3TR_C_GY_ODR_833Hz  =  7,
    LSM6DS3TR_C_GY_ODR_1k66Hz =  8,
    LSM6DS3TR_C_GY_ODR_3k33Hz =  9,
    LSM6DS3TR_C_GY_ODR_6k66Hz = 10,
    LSM6DS3TR_C_GY_ODR_ND     = 11,    /* ERROR CODE */
} lsm6ds3tr_c_odr_g_t;
int32_t lsm6ds3tr_c_gy_data_rate_set(const stmdev_ctx_t *ctx,
                                     lsm6ds3tr_c_odr_g_t val);
int32_t lsm6ds3tr_c_gy_data_rate_get(const stmdev_ctx_t *ctx,
                                     lsm6ds3tr_c_odr_g_t *val);

int32_t lsm6ds3tr_c_block_data_update_set(const stmdev_ctx_t *ctx,
        uint8_t val);
int32_t lsm6ds3tr_c_block_data_update_get(const stmdev_ctx_t *ctx,
        uint8_t *val);

typedef enum
{
    LSM6DS3TR_C_LSb_1mg   = 0,
    LSM6DS3TR_C_LSb_16mg  = 1,
    LSM6DS3TR_C_WEIGHT_ND = 2,
} lsm6ds3tr_c_usr_off_w_t;
int32_t lsm6ds3tr_c_xl_offset_weight_set(const stmdev_ctx_t *ctx,
        lsm6ds3tr_c_usr_off_w_t val);
int32_t lsm6ds3tr_c_xl_offset_weight_get(const stmdev_ctx_t *ctx,
        lsm6ds3tr_c_usr_off_w_t *val);

typedef enum
{
    LSM6DS3TR_C_XL_HIGH_PERFORMANCE  = 0,
    LSM6DS3TR_C_XL_NORMAL            = 1,
    LSM6DS3TR_C_XL_PW_MODE_ND        = 2,    /* ERROR CODE */
} lsm6ds3tr_c_xl_hm_mode_t;
int32_t lsm6ds3tr_c_xl_power_mode_set(const stmdev_ctx_t *ctx,
                                      lsm6ds3tr_c_xl_hm_mode_t val);
int32_t lsm6ds3tr_c_xl_power_mode_get(const stmdev_ctx_t *ctx,
                                      lsm6ds3tr_c_xl_hm_mode_t *val);

typedef enum
{
    LSM6DS3TR_C_STAT_RND_DISABLE  = 0,
    LSM6DS3TR_C_STAT_RND_ENABLE   = 1,
    LSM6DS3TR_C_STAT_RND_ND       = 2,    /* ERROR CODE */
} lsm6ds3tr_c_rounding_status_t;
int32_t lsm6ds3tr_c_rounding_on_status_set(const stmdev_ctx_t *ctx,
        lsm6ds3tr_c_rounding_status_t val);
int32_t lsm6ds3tr_c_rounding_on_status_get(const stmdev_ctx_t *ctx,
        lsm6ds3tr_c_rounding_status_t *val);

typedef enum
{
    LSM6DS3TR_C_GY_HIGH_PERFORMANCE  = 0,
    LSM6DS3TR_C_GY_NORMAL            = 1,
    LSM6DS3TR_C_GY_PW_MODE_ND        = 2,    /* ERROR CODE */
} lsm6ds3tr_c_g_hm_mode_t;
int32_t lsm6ds3tr_c_gy_power_mode_set(const stmdev_ctx_t *ctx,
                                      lsm6ds3tr_c_g_hm_mode_t val);
int32_t lsm6ds3tr_c_gy_power_mode_get(const stmdev_ctx_t *ctx,
                                      lsm6ds3tr_c_g_hm_mode_t *val);

typedef struct
{
    lsm6ds3tr_c_wake_up_src_t        wake_up_src;
    lsm6ds3tr_c_tap_src_t            tap_src;
    lsm6ds3tr_c_d6d_src_t            d6d_src;
    lsm6ds3tr_c_status_reg_t         status_reg;
    lsm6ds3tr_c_func_src1_t          func_src1;
    lsm6ds3tr_c_func_src2_t          func_src2;
    lsm6ds3tr_c_wrist_tilt_ia_t      wrist_tilt_ia;
    lsm6ds3tr_c_a_wrist_tilt_mask_t  a_wrist_tilt_mask;
} lsm6ds3tr_c_all_sources_t;
int32_t lsm6ds3tr_c_all_sources_get(const stmdev_ctx_t *ctx,
                                    lsm6ds3tr_c_all_sources_t *val);

int32_t lsm6ds3tr_c_status_reg_get(const stmdev_ctx_t *ctx,
                                   lsm6ds3tr_c_status_reg_t *val);

int32_t lsm6ds3tr_c_xl_flag_data_ready_get(const stmdev_ctx_t *ctx,
        uint8_t *val);

int32_t lsm6ds3tr_c_gy_flag_data_ready_get(const stmdev_ctx_t *ctx,
        uint8_t *val);

int32_t lsm6ds3tr_c_temp_flag_data_ready_get(const stmdev_ctx_t *ctx,
        uint8_t *val);

