RT-Thread-Studio/sdk-bsp-psoc_e84-edgi-talk/projects/Edgi_Talk_M55_Driver_All/packages/lsm6ds3tr/lsm6ds3tr-c_reg.h
int32_t lsm6ds3tr_c_xl_usr_offset_set(const stmdev_ctx_t *ctx,
                                      uint8_t *buff);
int32_t lsm6ds3tr_c_xl_usr_offset_get(const stmdev_ctx_t *ctx,
                                      uint8_t *buff);
int32_t lsm6ds3tr_c_timestamp_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6ds3tr_c_timestamp_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
    LSM6DS3TR_C_LSB_6ms4    = 0,
    LSM6DS3TR_C_LSB_25us    = 1,
    LSM6DS3TR_C_TS_RES_ND   = 2,    /* ERROR CODE */
} lsm6ds3tr_c_timer_hr_t;
int32_t lsm6ds3tr_c_timestamp_res_set(const stmdev_ctx_t *ctx,
                                      lsm6ds3tr_c_timer_hr_t val);
int32_t lsm6ds3tr_c_timestamp_res_get(const stmdev_ctx_t *ctx,
                                      lsm6ds3tr_c_timer_hr_t *val);

typedef enum
{
    LSM6DS3TR_C_ROUND_DISABLE            = 0,
    LSM6DS3TR_C_ROUND_XL                 = 1,
    LSM6DS3TR_C_ROUND_GY                 = 2,
    LSM6DS3TR_C_ROUND_GY_XL              = 3,
    LSM6DS3TR_C_ROUND_SH1_TO_SH6         = 4,
    LSM6DS3TR_C_ROUND_XL_SH1_TO_SH6      = 5,
    LSM6DS3TR_C_ROUND_GY_XL_SH1_TO_SH12  = 6,
    LSM6DS3TR_C_ROUND_GY_XL_SH1_TO_SH6   = 7,
    LSM6DS3TR_C_ROUND_OUT_ND             = 8,    /* ERROR CODE */
} lsm6ds3tr_c_rounding_t;
int32_t lsm6ds3tr_c_rounding_mode_set(const stmdev_ctx_t *ctx,
                                      lsm6ds3tr_c_rounding_t val);
int32_t lsm6ds3tr_c_rounding_mode_get(const stmdev_ctx_t *ctx,
                                      lsm6ds3tr_c_rounding_t *val);

int32_t lsm6ds3tr_c_temperature_raw_get(const stmdev_ctx_t *ctx,
                                        int16_t *val);
int32_t lsm6ds3tr_c_angular_rate_raw_get(const stmdev_ctx_t *ctx,
        int16_t *val);
int32_t lsm6ds3tr_c_acceleration_raw_get(const stmdev_ctx_t *ctx,
        int16_t *val);

int32_t lsm6ds3tr_c_mag_calibrated_raw_get(const stmdev_ctx_t *ctx,
        int16_t *val);

int32_t lsm6ds3tr_c_fifo_raw_data_get(const stmdev_ctx_t *ctx,
                                      uint8_t *buffer,
                                      uint8_t len);

typedef enum
{
    LSM6DS3TR_C_USER_BANK   = 0,
    LSM6DS3TR_C_BANK_A      = 4,
    LSM6DS3TR_C_BANK_B      = 5,
    LSM6DS3TR_C_BANK_ND     = 6,    /* ERROR CODE */
} lsm6ds3tr_c_func_cfg_en_t;
int32_t lsm6ds3tr_c_mem_bank_set(const stmdev_ctx_t *ctx,
                                 lsm6ds3tr_c_func_cfg_en_t val);
int32_t lsm6ds3tr_c_mem_bank_get(const stmdev_ctx_t *ctx,
                                 lsm6ds3tr_c_func_cfg_en_t *val);

typedef enum
{
    LSM6DS3TR_C_DRDY_LATCHED    = 0,
    LSM6DS3TR_C_DRDY_PULSED     = 1,
    LSM6DS3TR_C_DRDY_ND         = 2,  /* ERROR CODE */
} lsm6ds3tr_c_drdy_pulsed_g_t;
int32_t lsm6ds3tr_c_data_ready_mode_set(const stmdev_ctx_t *ctx,
                                        lsm6ds3tr_c_drdy_pulsed_g_t val);
int32_t lsm6ds3tr_c_data_ready_mode_get(const stmdev_ctx_t *ctx,
                                        lsm6ds3tr_c_drdy_pulsed_g_t *val);

int32_t lsm6ds3tr_c_device_id_get(const stmdev_ctx_t *ctx, uint8_t *buff);
int32_t lsm6ds3tr_c_reset_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6ds3tr_c_reset_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
    LSM6DS3TR_C_LSB_AT_LOW_ADD  = 0,
    LSM6DS3TR_C_MSB_AT_LOW_ADD  = 1,
    LSM6DS3TR_C_DATA_FMT_ND     = 2,    /* ERROR CODE */
} lsm6ds3tr_c_ble_t;
int32_t lsm6ds3tr_c_data_format_set(const stmdev_ctx_t *ctx,
                                    lsm6ds3tr_c_ble_t val);
int32_t lsm6ds3tr_c_data_format_get(const stmdev_ctx_t *ctx,
                                    lsm6ds3tr_c_ble_t *val);

int32_t lsm6ds3tr_c_auto_increment_set(const stmdev_ctx_t *ctx,
                                       uint8_t val);
int32_t lsm6ds3tr_c_auto_increment_get(const stmdev_ctx_t *ctx,
                                       uint8_t *val);

int32_t lsm6ds3tr_c_boot_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6ds3tr_c_boot_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
    LSM6DS3TR_C_XL_ST_DISABLE    = 0,
    LSM6DS3TR_C_XL_ST_POSITIVE   = 1,
    LSM6DS3TR_C_XL_ST_NEGATIVE   = 2,
    LSM6DS3TR_C_XL_ST_ND         = 3,    /* ERROR CODE */
} lsm6ds3tr_c_st_xl_t;
int32_t lsm6ds3tr_c_xl_self_test_set(const stmdev_ctx_t *ctx,
                                     lsm6ds3tr_c_st_xl_t val);
int32_t lsm6ds3tr_c_xl_self_test_get(const stmdev_ctx_t *ctx,
                                     lsm6ds3tr_c_st_xl_t *val);

typedef enum
{
    LSM6DS3TR_C_GY_ST_DISABLE    = 0,
    LSM6DS3TR_C_GY_ST_POSITIVE   = 1,
    LSM6DS3TR_C_GY_ST_NEGATIVE   = 3,
    LSM6DS3TR_C_GY_ST_ND         = 4,    /* ERROR CODE */
} lsm6ds3tr_c_st_g_t;
int32_t lsm6ds3tr_c_gy_self_test_set(const stmdev_ctx_t *ctx,
                                     lsm6ds3tr_c_st_g_t val);
int32_t lsm6ds3tr_c_gy_self_test_get(const stmdev_ctx_t *ctx,
                                     lsm6ds3tr_c_st_g_t *val);

int32_t lsm6ds3tr_c_filter_settling_mask_set(const stmdev_ctx_t *ctx,
        uint8_t val);
int32_t lsm6ds3tr_c_filter_settling_mask_get(const stmdev_ctx_t *ctx,
        uint8_t *val);

typedef enum
{
    LSM6DS3TR_C_USE_SLOPE    = 0,
    LSM6DS3TR_C_USE_HPF      = 1,
    LSM6DS3TR_C_HP_PATH_ND   = 2,    /* ERROR CODE */
} lsm6ds3tr_c_slope_fds_t;
int32_t lsm6ds3tr_c_xl_hp_path_internal_set(const stmdev_ctx_t *ctx,
        lsm6ds3tr_c_slope_fds_t val);
int32_t lsm6ds3tr_c_xl_hp_path_internal_get(const stmdev_ctx_t *ctx,
        lsm6ds3tr_c_slope_fds_t *val);

typedef enum
{
    LSM6DS3TR_C_XL_ANA_BW_1k5Hz = 0,
    LSM6DS3TR_C_XL_ANA_BW_400Hz = 1,
    LSM6DS3TR_C_XL_ANA_BW_ND    = 2,    /* ERROR CODE */
} lsm6ds3tr_c_bw0_xl_t;
int32_t lsm6ds3tr_c_xl_filter_analog_set(const stmdev_ctx_t *ctx,
        lsm6ds3tr_c_bw0_xl_t val);
int32_t lsm6ds3tr_c_xl_filter_analog_get(const stmdev_ctx_t *ctx,
        lsm6ds3tr_c_bw0_xl_t *val);

typedef enum
{
    LSM6DS3TR_C_XL_LP1_ODR_DIV_2 = 0,
    LSM6DS3TR_C_XL_LP1_ODR_DIV_4 = 1,
    LSM6DS3TR_C_XL_LP1_NA        = 2,  /* ERROR CODE */
} lsm6ds3tr_c_lpf1_bw_sel_t;
int32_t lsm6ds3tr_c_xl_lp1_bandwidth_set(const stmdev_ctx_t *ctx,
        lsm6ds3tr_c_lpf1_bw_sel_t val);
int32_t lsm6ds3tr_c_xl_lp1_bandwidth_get(const stmdev_ctx_t *ctx,
        lsm6ds3tr_c_lpf1_bw_sel_t *val);

