RT-Thread-Studio/sdk-bsp-psoc_e84-edgi-talk/projects/Edgi_Talk_M55_Driver_All/packages/lsm6ds3tr/lsm6ds3tr-c_reg.h
typedef enum
{
    LSM6DS3TR_C_XL_LOW_LAT_LP_ODR_DIV_50     = 0x00,
    LSM6DS3TR_C_XL_LOW_LAT_LP_ODR_DIV_100    = 0x01,
    LSM6DS3TR_C_XL_LOW_LAT_LP_ODR_DIV_9      = 0x02,
    LSM6DS3TR_C_XL_LOW_LAT_LP_ODR_DIV_400    = 0x03,
    LSM6DS3TR_C_XL_LOW_NOISE_LP_ODR_DIV_50   = 0x10,
    LSM6DS3TR_C_XL_LOW_NOISE_LP_ODR_DIV_100  = 0x11,
    LSM6DS3TR_C_XL_LOW_NOISE_LP_ODR_DIV_9    = 0x12,
    LSM6DS3TR_C_XL_LOW_NOISE_LP_ODR_DIV_400  = 0x13,
    LSM6DS3TR_C_XL_LP_NA                     = 0x20, /* ERROR CODE */
} lsm6ds3tr_c_input_composite_t;
int32_t lsm6ds3tr_c_xl_lp2_bandwidth_set(const stmdev_ctx_t *ctx,
        lsm6ds3tr_c_input_composite_t val);
int32_t lsm6ds3tr_c_xl_lp2_bandwidth_get(const stmdev_ctx_t *ctx,
        lsm6ds3tr_c_input_composite_t *val);

int32_t lsm6ds3tr_c_xl_reference_mode_set(const stmdev_ctx_t *ctx,
        uint8_t val);
int32_t lsm6ds3tr_c_xl_reference_mode_get(const stmdev_ctx_t *ctx,
        uint8_t *val);

typedef enum
{
    LSM6DS3TR_C_XL_HP_ODR_DIV_4      = 0x00, /* Slope filter */
    LSM6DS3TR_C_XL_HP_ODR_DIV_100    = 0x01,
    LSM6DS3TR_C_XL_HP_ODR_DIV_9      = 0x02,
    LSM6DS3TR_C_XL_HP_ODR_DIV_400    = 0x03,
    LSM6DS3TR_C_XL_HP_NA             = 0x10, /* ERROR CODE */
} lsm6ds3tr_c_hpcf_xl_t;
int32_t lsm6ds3tr_c_xl_hp_bandwidth_set(const stmdev_ctx_t *ctx,
                                        lsm6ds3tr_c_hpcf_xl_t val);
int32_t lsm6ds3tr_c_xl_hp_bandwidth_get(const stmdev_ctx_t *ctx,
                                        lsm6ds3tr_c_hpcf_xl_t *val);

typedef enum
{
    LSM6DS3TR_C_LP2_ONLY                    = 0x00,

    LSM6DS3TR_C_HP_16mHz_LP2                = 0x80,
    LSM6DS3TR_C_HP_65mHz_LP2                = 0x90,
    LSM6DS3TR_C_HP_260mHz_LP2               = 0xA0,
    LSM6DS3TR_C_HP_1Hz04_LP2                = 0xB0,

    LSM6DS3TR_C_HP_DISABLE_LP1_LIGHT        = 0x0A,
    LSM6DS3TR_C_HP_DISABLE_LP1_NORMAL       = 0x09,
    LSM6DS3TR_C_HP_DISABLE_LP_STRONG        = 0x08,
    LSM6DS3TR_C_HP_DISABLE_LP1_AGGRESSIVE   = 0x0B,

    LSM6DS3TR_C_HP_16mHz_LP1_LIGHT          = 0x8A,
    LSM6DS3TR_C_HP_65mHz_LP1_NORMAL         = 0x99,
    LSM6DS3TR_C_HP_260mHz_LP1_STRONG        = 0xA8,
    LSM6DS3TR_C_HP_1Hz04_LP1_AGGRESSIVE     = 0xBB,

    LSM6DS3TR_C_HP_GY_BAND_NA               = 0xFF,    /* ERROR CODE */
} lsm6ds3tr_c_lpf1_sel_g_t;
int32_t lsm6ds3tr_c_gy_band_pass_set(const stmdev_ctx_t *ctx,
                                     lsm6ds3tr_c_lpf1_sel_g_t val);
int32_t lsm6ds3tr_c_gy_band_pass_get(const stmdev_ctx_t *ctx,
                                     lsm6ds3tr_c_lpf1_sel_g_t *val);

typedef enum
{
    LSM6DS3TR_C_SPI_4_WIRE  = 0,
    LSM6DS3TR_C_SPI_3_WIRE  = 1,
    LSM6DS3TR_C_SPI_MODE_ND = 2,    /* ERROR CODE */
} lsm6ds3tr_c_sim_t;
int32_t lsm6ds3tr_c_spi_mode_set(const stmdev_ctx_t *ctx,
                                 lsm6ds3tr_c_sim_t val);
int32_t lsm6ds3tr_c_spi_mode_get(const stmdev_ctx_t *ctx,
                                 lsm6ds3tr_c_sim_t *val);

typedef enum
{
    LSM6DS3TR_C_I2C_ENABLE   = 0,
    LSM6DS3TR_C_I2C_DISABLE  = 1,
    LSM6DS3TR_C_I2C_MODE_ND  = 2,    /* ERROR CODE */
} lsm6ds3tr_c_i2c_disable_t;
int32_t lsm6ds3tr_c_i2c_interface_set(const stmdev_ctx_t *ctx,
                                      lsm6ds3tr_c_i2c_disable_t val);
int32_t lsm6ds3tr_c_i2c_interface_get(const stmdev_ctx_t *ctx,
                                      lsm6ds3tr_c_i2c_disable_t *val);

typedef struct
{
    uint8_t int1_drdy_xl             : 1;
    uint8_t int1_drdy_g              : 1;
    uint8_t int1_boot                : 1;
    uint8_t int1_fth                 : 1;
    uint8_t int1_fifo_ovr            : 1;
    uint8_t int1_full_flag           : 1;
    uint8_t int1_sign_mot            : 1;
    uint8_t int1_step_detector       : 1;
    uint8_t int1_timer               : 1;
    uint8_t int1_tilt                : 1;
    uint8_t int1_6d                  : 1;
    uint8_t int1_double_tap          : 1;
    uint8_t int1_ff                  : 1;
    uint8_t int1_wu                  : 1;
    uint8_t int1_single_tap          : 1;
    uint8_t int1_inact_state         : 1;
    uint8_t den_drdy_int1            : 1;
    uint8_t drdy_on_int1             : 1;
} lsm6ds3tr_c_int1_route_t;
int32_t lsm6ds3tr_c_pin_int1_route_set(const stmdev_ctx_t *ctx,
                                       lsm6ds3tr_c_int1_route_t val);
int32_t lsm6ds3tr_c_pin_int1_route_get(const stmdev_ctx_t *ctx,
                                       lsm6ds3tr_c_int1_route_t *val);

typedef struct
{
    uint8_t int2_drdy_xl             : 1;
    uint8_t int2_drdy_g              : 1;
    uint8_t int2_drdy_temp           : 1;
    uint8_t int2_fth                 : 1;
    uint8_t int2_fifo_ovr            : 1;
    uint8_t int2_full_flag           : 1;
    uint8_t int2_step_count_ov       : 1;
    uint8_t int2_step_delta          : 1;
    uint8_t int2_iron                : 1;
    uint8_t int2_tilt                : 1;
    uint8_t int2_6d                  : 1;
    uint8_t int2_double_tap          : 1;
    uint8_t int2_ff                  : 1;
    uint8_t int2_wu                  : 1;
    uint8_t int2_single_tap          : 1;
    uint8_t int2_inact_state         : 1;
    uint8_t int2_wrist_tilt          : 1;
} lsm6ds3tr_c_int2_route_t;
int32_t lsm6ds3tr_c_pin_int2_route_set(const stmdev_ctx_t *ctx,
                                       lsm6ds3tr_c_int2_route_t val);
int32_t lsm6ds3tr_c_pin_int2_route_get(const stmdev_ctx_t *ctx,
                                       lsm6ds3tr_c_int2_route_t *val);

typedef enum
{
    LSM6DS3TR_C_PUSH_PULL   = 0,
    LSM6DS3TR_C_OPEN_DRAIN  = 1,
    LSM6DS3TR_C_PIN_MODE_ND = 2,    /* ERROR CODE */
} lsm6ds3tr_c_pp_od_t;
int32_t lsm6ds3tr_c_pin_mode_set(const stmdev_ctx_t *ctx,
                                 lsm6ds3tr_c_pp_od_t val);
int32_t lsm6ds3tr_c_pin_mode_get(const stmdev_ctx_t *ctx,
                                 lsm6ds3tr_c_pp_od_t *val);

typedef enum
{
    LSM6DS3TR_C_ACTIVE_HIGH   = 0,
    LSM6DS3TR_C_ACTIVE_LOW    = 1,
    LSM6DS3TR_C_POLARITY_ND   = 2,    /* ERROR CODE */
} lsm6ds3tr_c_h_lactive_t;
int32_t lsm6ds3tr_c_pin_polarity_set(const stmdev_ctx_t *ctx,
                                     lsm6ds3tr_c_h_lactive_t val);
int32_t lsm6ds3tr_c_pin_polarity_get(const stmdev_ctx_t *ctx,
                                     lsm6ds3tr_c_h_lactive_t *val);

