RT-Thread-Studio/sdk-bsp-psoc_e84-edgi-talk/projects/Edgi_Talk_M55_Driver_All/packages/lsm6ds3tr/lsm6ds3tr-c_reg.h
int32_t lsm6ds3tr_c_all_on_int1_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6ds3tr_c_all_on_int1_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
    LSM6DS3TR_C_INT_PULSED   = 0,
    LSM6DS3TR_C_INT_LATCHED  = 1,
    LSM6DS3TR_C_INT_MODE     = 2,    /* ERROR CODE */
} lsm6ds3tr_c_lir_t;
int32_t lsm6ds3tr_c_int_notification_set(const stmdev_ctx_t *ctx,
        lsm6ds3tr_c_lir_t val);
int32_t lsm6ds3tr_c_int_notification_get(const stmdev_ctx_t *ctx,
        lsm6ds3tr_c_lir_t *val);

int32_t lsm6ds3tr_c_wkup_threshold_set(const stmdev_ctx_t *ctx,
                                       uint8_t val);
int32_t lsm6ds3tr_c_wkup_threshold_get(const stmdev_ctx_t *ctx,
                                       uint8_t *val);

int32_t lsm6ds3tr_c_wkup_dur_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6ds3tr_c_wkup_dur_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6ds3tr_c_gy_sleep_mode_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6ds3tr_c_gy_sleep_mode_get(const stmdev_ctx_t *ctx,
                                      uint8_t *val);

typedef enum
{
    LSM6DS3TR_C_PROPERTY_DISABLE          = 0,
    LSM6DS3TR_C_XL_12Hz5_GY_NOT_AFFECTED  = 1,
    LSM6DS3TR_C_XL_12Hz5_GY_SLEEP         = 2,
    LSM6DS3TR_C_XL_12Hz5_GY_PD            = 3,
    LSM6DS3TR_C_ACT_MODE_ND               = 4,    /* ERROR CODE */
} lsm6ds3tr_c_inact_en_t;
int32_t lsm6ds3tr_c_act_mode_set(const stmdev_ctx_t *ctx,
                                 lsm6ds3tr_c_inact_en_t val);
int32_t lsm6ds3tr_c_act_mode_get(const stmdev_ctx_t *ctx,
                                 lsm6ds3tr_c_inact_en_t *val);

int32_t lsm6ds3tr_c_act_sleep_dur_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6ds3tr_c_act_sleep_dur_get(const stmdev_ctx_t *ctx,
                                      uint8_t *val);

int32_t lsm6ds3tr_c_tap_src_get(const stmdev_ctx_t *ctx,
                                lsm6ds3tr_c_tap_src_t *val);

int32_t lsm6ds3tr_c_tap_detection_on_z_set(const stmdev_ctx_t *ctx,
        uint8_t val);
int32_t lsm6ds3tr_c_tap_detection_on_z_get(const stmdev_ctx_t *ctx,
        uint8_t *val);

int32_t lsm6ds3tr_c_tap_detection_on_y_set(const stmdev_ctx_t *ctx,
        uint8_t val);
int32_t lsm6ds3tr_c_tap_detection_on_y_get(const stmdev_ctx_t *ctx,
        uint8_t *val);

int32_t lsm6ds3tr_c_tap_detection_on_x_set(const stmdev_ctx_t *ctx,
        uint8_t val);
int32_t lsm6ds3tr_c_tap_detection_on_x_get(const stmdev_ctx_t *ctx,
        uint8_t *val);

int32_t lsm6ds3tr_c_tap_threshold_x_set(const stmdev_ctx_t *ctx,
                                        uint8_t val);
int32_t lsm6ds3tr_c_tap_threshold_x_get(const stmdev_ctx_t *ctx,
                                        uint8_t *val);

int32_t lsm6ds3tr_c_tap_shock_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6ds3tr_c_tap_shock_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6ds3tr_c_tap_quiet_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6ds3tr_c_tap_quiet_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6ds3tr_c_tap_dur_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6ds3tr_c_tap_dur_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
    LSM6DS3TR_C_ONLY_SINGLE          = 0,
    LSM6DS3TR_C_BOTH_SINGLE_DOUBLE   = 1,
    LSM6DS3TR_C_TAP_MODE_ND          = 2,    /* ERROR CODE */
} lsm6ds3tr_c_single_double_tap_t;
int32_t lsm6ds3tr_c_tap_mode_set(const stmdev_ctx_t *ctx,
                                 lsm6ds3tr_c_single_double_tap_t val);
int32_t lsm6ds3tr_c_tap_mode_get(const stmdev_ctx_t *ctx,
                                 lsm6ds3tr_c_single_double_tap_t *val);

typedef enum
{
    LSM6DS3TR_C_ODR_DIV_2_FEED      = 0,
    LSM6DS3TR_C_LPF2_FEED           = 1,
    LSM6DS3TR_C_6D_FEED_ND          = 2,    /* ERROR CODE */
} lsm6ds3tr_c_low_pass_on_6d_t;
int32_t lsm6ds3tr_c_6d_feed_data_set(const stmdev_ctx_t *ctx,
                                     lsm6ds3tr_c_low_pass_on_6d_t val);
int32_t lsm6ds3tr_c_6d_feed_data_get(const stmdev_ctx_t *ctx,
                                     lsm6ds3tr_c_low_pass_on_6d_t *val);

typedef enum
{
    LSM6DS3TR_C_DEG_80      = 0,
    LSM6DS3TR_C_DEG_70      = 1,
    LSM6DS3TR_C_DEG_60      = 2,
    LSM6DS3TR_C_DEG_50      = 3,
    LSM6DS3TR_C_6D_TH_ND    = 4,    /* ERROR CODE */
} lsm6ds3tr_c_sixd_ths_t;
int32_t lsm6ds3tr_c_6d_threshold_set(const stmdev_ctx_t *ctx,
                                     lsm6ds3tr_c_sixd_ths_t val);
int32_t lsm6ds3tr_c_6d_threshold_get(const stmdev_ctx_t *ctx,
                                     lsm6ds3tr_c_sixd_ths_t *val);

int32_t lsm6ds3tr_c_4d_mode_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6ds3tr_c_4d_mode_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6ds3tr_c_ff_dur_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6ds3tr_c_ff_dur_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
    LSM6DS3TR_C_FF_TSH_156mg = 0,
    LSM6DS3TR_C_FF_TSH_219mg = 1,
    LSM6DS3TR_C_FF_TSH_250mg = 2,
    LSM6DS3TR_C_FF_TSH_312mg = 3,
    LSM6DS3TR_C_FF_TSH_344mg = 4,
    LSM6DS3TR_C_FF_TSH_406mg = 5,
    LSM6DS3TR_C_FF_TSH_469mg = 6,
    LSM6DS3TR_C_FF_TSH_500mg = 7,
    LSM6DS3TR_C_FF_TSH_ND    = 8,    /* ERROR CODE */
} lsm6ds3tr_c_ff_ths_t;
int32_t lsm6ds3tr_c_ff_threshold_set(const stmdev_ctx_t *ctx,
                                     lsm6ds3tr_c_ff_ths_t val);
int32_t lsm6ds3tr_c_ff_threshold_get(const stmdev_ctx_t *ctx,
                                     lsm6ds3tr_c_ff_ths_t *val);

int32_t lsm6ds3tr_c_fifo_watermark_set(const stmdev_ctx_t *ctx,
                                       uint16_t val);
int32_t lsm6ds3tr_c_fifo_watermark_get(const stmdev_ctx_t *ctx,
                                       uint16_t *val);

int32_t lsm6ds3tr_c_fifo_data_level_get(const stmdev_ctx_t *ctx,
                                        uint16_t *val);

int32_t lsm6ds3tr_c_fifo_wtm_flag_get(const stmdev_ctx_t *ctx,
                                      uint8_t *val);

int32_t lsm6ds3tr_c_fifo_pattern_get(const stmdev_ctx_t *ctx,
                                     uint16_t *val);

int32_t lsm6ds3tr_c_fifo_temp_batch_set(const stmdev_ctx_t *ctx,
                                        uint8_t val);
int32_t lsm6ds3tr_c_fifo_temp_batch_get(const stmdev_ctx_t *ctx,
                                        uint8_t *val);

