RT-Thread-Studio/sdk-bsp-psoc_e84-edgi-talk/projects/Edgi_Talk_M55_Driver_All/packages/lsm6ds3tr/lsm6ds3tr-c_reg.h
typedef enum
{
    LSM6DS3TR_C_TRG_XL_GY_DRDY     = 0,
    LSM6DS3TR_C_TRG_STEP_DETECT    = 1,
    LSM6DS3TR_C_TRG_SH_DRDY        = 2,
    LSM6DS3TR_C_TRG_SH_ND          = 3,    /* ERROR CODE */
} lsm6ds3tr_c_trigger_fifo_t;
int32_t lsm6ds3tr_c_fifo_write_trigger_set(const stmdev_ctx_t *ctx,
        lsm6ds3tr_c_trigger_fifo_t val);
int32_t lsm6ds3tr_c_fifo_write_trigger_get(const stmdev_ctx_t *ctx,
        lsm6ds3tr_c_trigger_fifo_t *val);

int32_t lsm6ds3tr_c_fifo_pedo_and_timestamp_batch_set(
    stmdev_ctx_t *ctx,
    uint8_t val);
int32_t lsm6ds3tr_c_fifo_pedo_and_timestamp_batch_get(
    stmdev_ctx_t *ctx,
    uint8_t *val);

typedef enum
{
    LSM6DS3TR_C_FIFO_XL_DISABLE  = 0,
    LSM6DS3TR_C_FIFO_XL_NO_DEC   = 1,
    LSM6DS3TR_C_FIFO_XL_DEC_2    = 2,
    LSM6DS3TR_C_FIFO_XL_DEC_3    = 3,
    LSM6DS3TR_C_FIFO_XL_DEC_4    = 4,
    LSM6DS3TR_C_FIFO_XL_DEC_8    = 5,
    LSM6DS3TR_C_FIFO_XL_DEC_16   = 6,
    LSM6DS3TR_C_FIFO_XL_DEC_32   = 7,
    LSM6DS3TR_C_FIFO_XL_DEC_ND   = 8,    /* ERROR CODE */
} lsm6ds3tr_c_dec_fifo_xl_t;
int32_t lsm6ds3tr_c_fifo_xl_batch_set(const stmdev_ctx_t *ctx,
                                      lsm6ds3tr_c_dec_fifo_xl_t val);
int32_t lsm6ds3tr_c_fifo_xl_batch_get(const stmdev_ctx_t *ctx,
                                      lsm6ds3tr_c_dec_fifo_xl_t *val);

typedef enum
{
    LSM6DS3TR_C_FIFO_GY_DISABLE = 0,
    LSM6DS3TR_C_FIFO_GY_NO_DEC  = 1,
    LSM6DS3TR_C_FIFO_GY_DEC_2   = 2,
    LSM6DS3TR_C_FIFO_GY_DEC_3   = 3,
    LSM6DS3TR_C_FIFO_GY_DEC_4   = 4,
    LSM6DS3TR_C_FIFO_GY_DEC_8   = 5,
    LSM6DS3TR_C_FIFO_GY_DEC_16  = 6,
    LSM6DS3TR_C_FIFO_GY_DEC_32  = 7,
    LSM6DS3TR_C_FIFO_GY_DEC_ND  = 8,    /* ERROR CODE */
} lsm6ds3tr_c_dec_fifo_gyro_t;
int32_t lsm6ds3tr_c_fifo_gy_batch_set(const stmdev_ctx_t *ctx,
                                      lsm6ds3tr_c_dec_fifo_gyro_t val);
int32_t lsm6ds3tr_c_fifo_gy_batch_get(const stmdev_ctx_t *ctx,
                                      lsm6ds3tr_c_dec_fifo_gyro_t *val);

typedef enum
{
    LSM6DS3TR_C_FIFO_DS3_DISABLE   = 0,
    LSM6DS3TR_C_FIFO_DS3_NO_DEC    = 1,
    LSM6DS3TR_C_FIFO_DS3_DEC_2     = 2,
    LSM6DS3TR_C_FIFO_DS3_DEC_3     = 3,
    LSM6DS3TR_C_FIFO_DS3_DEC_4     = 4,
    LSM6DS3TR_C_FIFO_DS3_DEC_8     = 5,
    LSM6DS3TR_C_FIFO_DS3_DEC_16    = 6,
    LSM6DS3TR_C_FIFO_DS3_DEC_32    = 7,
    LSM6DS3TR_C_FIFO_DS3_DEC_ND    = 8,    /* ERROR CODE */
} lsm6ds3tr_c_dec_ds3_fifo_t;
int32_t lsm6ds3tr_c_fifo_dataset_3_batch_set(const stmdev_ctx_t *ctx,
        lsm6ds3tr_c_dec_ds3_fifo_t val);
int32_t lsm6ds3tr_c_fifo_dataset_3_batch_get(const stmdev_ctx_t *ctx,
        lsm6ds3tr_c_dec_ds3_fifo_t *val);

typedef enum
{
    LSM6DS3TR_C_FIFO_DS4_DISABLE  = 0,
    LSM6DS3TR_C_FIFO_DS4_NO_DEC   = 1,
    LSM6DS3TR_C_FIFO_DS4_DEC_2    = 2,
    LSM6DS3TR_C_FIFO_DS4_DEC_3    = 3,
    LSM6DS3TR_C_FIFO_DS4_DEC_4    = 4,
    LSM6DS3TR_C_FIFO_DS4_DEC_8    = 5,
    LSM6DS3TR_C_FIFO_DS4_DEC_16   = 6,
    LSM6DS3TR_C_FIFO_DS4_DEC_32   = 7,
    LSM6DS3TR_C_FIFO_DS4_DEC_ND   = 8,    /* ERROR CODE */
} lsm6ds3tr_c_dec_ds4_fifo_t;
int32_t lsm6ds3tr_c_fifo_dataset_4_batch_set(const stmdev_ctx_t *ctx,
        lsm6ds3tr_c_dec_ds4_fifo_t val);
int32_t lsm6ds3tr_c_fifo_dataset_4_batch_get(const stmdev_ctx_t *ctx,
        lsm6ds3tr_c_dec_ds4_fifo_t *val);

int32_t lsm6ds3tr_c_fifo_xl_gy_8bit_format_set(const stmdev_ctx_t *ctx,
        uint8_t val);
int32_t lsm6ds3tr_c_fifo_xl_gy_8bit_format_get(const stmdev_ctx_t *ctx,
        uint8_t *val);

int32_t lsm6ds3tr_c_fifo_stop_on_wtm_set(const stmdev_ctx_t *ctx,
        uint8_t val);
int32_t lsm6ds3tr_c_fifo_stop_on_wtm_get(const stmdev_ctx_t *ctx,
        uint8_t *val);

typedef enum
{
    LSM6DS3TR_C_BYPASS_MODE           = 0,
    LSM6DS3TR_C_FIFO_MODE             = 1,
    LSM6DS3TR_C_STREAM_TO_FIFO_MODE   = 3,
    LSM6DS3TR_C_BYPASS_TO_STREAM_MODE = 4,
    LSM6DS3TR_C_STREAM_MODE           = 6,
    LSM6DS3TR_C_FIFO_MODE_ND          = 8,    /* ERROR CODE */
} lsm6ds3tr_c_fifo_mode_t;
int32_t lsm6ds3tr_c_fifo_mode_set(const stmdev_ctx_t *ctx,
                                  lsm6ds3tr_c_fifo_mode_t val);
int32_t lsm6ds3tr_c_fifo_mode_get(const stmdev_ctx_t *ctx,
                                  lsm6ds3tr_c_fifo_mode_t *val);

typedef enum
{
    LSM6DS3TR_C_FIFO_DISABLE   =  0,
    LSM6DS3TR_C_FIFO_12Hz5     =  1,
    LSM6DS3TR_C_FIFO_26Hz      =  2,
    LSM6DS3TR_C_FIFO_52Hz      =  3,
    LSM6DS3TR_C_FIFO_104Hz     =  4,
    LSM6DS3TR_C_FIFO_208Hz     =  5,
    LSM6DS3TR_C_FIFO_416Hz     =  6,
    LSM6DS3TR_C_FIFO_833Hz     =  7,
    LSM6DS3TR_C_FIFO_1k66Hz    =  8,
    LSM6DS3TR_C_FIFO_3k33Hz    =  9,
    LSM6DS3TR_C_FIFO_6k66Hz    = 10,
    LSM6DS3TR_C_FIFO_RATE_ND   = 11,    /* ERROR CODE */
} lsm6ds3tr_c_odr_fifo_t;
int32_t lsm6ds3tr_c_fifo_data_rate_set(const stmdev_ctx_t *ctx,
                                       lsm6ds3tr_c_odr_fifo_t val);
int32_t lsm6ds3tr_c_fifo_data_rate_get(const stmdev_ctx_t *ctx,
                                       lsm6ds3tr_c_odr_fifo_t *val);

typedef enum
{
    LSM6DS3TR_C_DEN_ACT_LOW    = 0,
    LSM6DS3TR_C_DEN_ACT_HIGH   = 1,
    LSM6DS3TR_C_DEN_POL_ND     = 2,    /* ERROR CODE */
} lsm6ds3tr_c_den_lh_t;
int32_t lsm6ds3tr_c_den_polarity_set(const stmdev_ctx_t *ctx,
                                     lsm6ds3tr_c_den_lh_t val);
int32_t lsm6ds3tr_c_den_polarity_get(const stmdev_ctx_t *ctx,
                                     lsm6ds3tr_c_den_lh_t *val);

typedef enum
{
    LSM6DS3TR_C_DEN_DISABLE    = 0,
    LSM6DS3TR_C_LEVEL_FIFO     = 6,
    LSM6DS3TR_C_LEVEL_LETCHED  = 3,
    LSM6DS3TR_C_LEVEL_TRIGGER  = 2,
    LSM6DS3TR_C_EDGE_TRIGGER   = 4,
    LSM6DS3TR_C_DEN_MODE_ND    = 5,    /* ERROR CODE */
} lsm6ds3tr_c_den_mode_t;
int32_t lsm6ds3tr_c_den_mode_set(const stmdev_ctx_t *ctx,
                                 lsm6ds3tr_c_den_mode_t val);
int32_t lsm6ds3tr_c_den_mode_get(const stmdev_ctx_t *ctx,
                                 lsm6ds3tr_c_den_mode_t *val);

typedef enum
{
    LSM6DS3TR_C_STAMP_IN_GY_DATA     = 0,
    LSM6DS3TR_C_STAMP_IN_XL_DATA     = 1,
    LSM6DS3TR_C_STAMP_IN_GY_XL_DATA  = 2,
    LSM6DS3TR_C_DEN_STAMP_ND         = 3,    /* ERROR CODE */
} lsm6ds3tr_c_den_xl_en_t;
int32_t lsm6ds3tr_c_den_enable_set(const stmdev_ctx_t *ctx,
                                   lsm6ds3tr_c_den_xl_en_t val);
int32_t lsm6ds3tr_c_den_enable_get(const stmdev_ctx_t *ctx,
                                   lsm6ds3tr_c_den_xl_en_t *val);

int32_t lsm6ds3tr_c_den_mark_axis_z_set(const stmdev_ctx_t *ctx,
                                        uint8_t val);
int32_t lsm6ds3tr_c_den_mark_axis_z_get(const stmdev_ctx_t *ctx,
                                        uint8_t *val);

int32_t lsm6ds3tr_c_den_mark_axis_y_set(const stmdev_ctx_t *ctx,
                                        uint8_t val);
int32_t lsm6ds3tr_c_den_mark_axis_y_get(const stmdev_ctx_t *ctx,
                                        uint8_t *val);

int32_t lsm6ds3tr_c_den_mark_axis_x_set(const stmdev_ctx_t *ctx,
                                        uint8_t val);
int32_t lsm6ds3tr_c_den_mark_axis_x_get(const stmdev_ctx_t *ctx,
                                        uint8_t *val);

int32_t lsm6ds3tr_c_pedo_step_reset_set(const stmdev_ctx_t *ctx,
                                        uint8_t val);
int32_t lsm6ds3tr_c_pedo_step_reset_get(const stmdev_ctx_t *ctx,
                                        uint8_t *val);

int32_t lsm6ds3tr_c_pedo_sens_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6ds3tr_c_pedo_sens_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6ds3tr_c_pedo_threshold_set(const stmdev_ctx_t *ctx,
                                       uint8_t val);
int32_t lsm6ds3tr_c_pedo_threshold_get(const stmdev_ctx_t *ctx,
                                       uint8_t *val);

