RT-Thread-Studio/sdk-bsp-psoc_e84-edgi-talk/projects/Edgi_Talk_M55_Driver_All/packages/lsm6ds3tr/lsm6ds3tr-c_reg.h
typedef enum
{
    LSM6DS3TR_C_PEDO_AT_2g = 0,
    LSM6DS3TR_C_PEDO_AT_4g = 1,
    LSM6DS3TR_C_PEDO_FS_ND = 2,    /* ERROR CODE */
} lsm6ds3tr_c_pedo_fs_t;
int32_t lsm6ds3tr_c_pedo_full_scale_set(const stmdev_ctx_t *ctx,
                                        lsm6ds3tr_c_pedo_fs_t val);
int32_t lsm6ds3tr_c_pedo_full_scale_get(const stmdev_ctx_t *ctx,
                                        lsm6ds3tr_c_pedo_fs_t *val);

int32_t lsm6ds3tr_c_pedo_debounce_steps_set(const stmdev_ctx_t *ctx,
        uint8_t val);
int32_t lsm6ds3tr_c_pedo_debounce_steps_get(const stmdev_ctx_t *ctx,
        uint8_t *val);

int32_t lsm6ds3tr_c_pedo_timeout_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6ds3tr_c_pedo_timeout_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6ds3tr_c_pedo_steps_period_set(const stmdev_ctx_t *ctx,
        uint8_t *buff);
int32_t lsm6ds3tr_c_pedo_steps_period_get(const stmdev_ctx_t *ctx,
        uint8_t *buff);

int32_t lsm6ds3tr_c_motion_sens_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6ds3tr_c_motion_sens_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6ds3tr_c_motion_threshold_set(const stmdev_ctx_t *ctx,
        uint8_t *buff);
int32_t lsm6ds3tr_c_motion_threshold_get(const stmdev_ctx_t *ctx,
        uint8_t *buff);

int32_t lsm6ds3tr_c_tilt_sens_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6ds3tr_c_tilt_sens_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6ds3tr_c_wrist_tilt_sens_set(const stmdev_ctx_t *ctx,
                                        uint8_t val);
int32_t lsm6ds3tr_c_wrist_tilt_sens_get(const stmdev_ctx_t *ctx,
                                        uint8_t *val);

int32_t lsm6ds3tr_c_tilt_latency_set(const stmdev_ctx_t *ctx,
                                     uint8_t *buff);
int32_t lsm6ds3tr_c_tilt_latency_get(const stmdev_ctx_t *ctx,
                                     uint8_t *buff);

int32_t lsm6ds3tr_c_tilt_threshold_set(const stmdev_ctx_t *ctx,
                                       uint8_t *buff);
int32_t lsm6ds3tr_c_tilt_threshold_get(const stmdev_ctx_t *ctx,
                                       uint8_t *buff);

int32_t lsm6ds3tr_c_tilt_src_set(const stmdev_ctx_t *ctx,
                                 lsm6ds3tr_c_a_wrist_tilt_mask_t *val);
int32_t lsm6ds3tr_c_tilt_src_get(const stmdev_ctx_t *ctx,
                                 lsm6ds3tr_c_a_wrist_tilt_mask_t *val);

int32_t lsm6ds3tr_c_mag_soft_iron_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6ds3tr_c_mag_soft_iron_get(const stmdev_ctx_t *ctx,
                                      uint8_t *val);

int32_t lsm6ds3tr_c_mag_hard_iron_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6ds3tr_c_mag_hard_iron_get(const stmdev_ctx_t *ctx,
                                      uint8_t *val);

int32_t lsm6ds3tr_c_mag_soft_iron_mat_set(const stmdev_ctx_t *ctx,
        uint8_t *buff);
int32_t lsm6ds3tr_c_mag_soft_iron_mat_get(const stmdev_ctx_t *ctx,
        uint8_t *buff);

int32_t lsm6ds3tr_c_mag_offset_set(const stmdev_ctx_t *ctx, int16_t *val);
int32_t lsm6ds3tr_c_mag_offset_get(const stmdev_ctx_t *ctx, int16_t *val);

int32_t lsm6ds3tr_c_func_en_set(const stmdev_ctx_t *ctx, uint8_t val);

int32_t lsm6ds3tr_c_sh_sync_sens_frame_set(const stmdev_ctx_t *ctx,
        uint8_t val);
int32_t lsm6ds3tr_c_sh_sync_sens_frame_get(const stmdev_ctx_t *ctx,
        uint8_t *val);

typedef enum
{
    LSM6DS3TR_C_RES_RATIO_2_11  = 0,
    LSM6DS3TR_C_RES_RATIO_2_12  = 1,
    LSM6DS3TR_C_RES_RATIO_2_13  = 2,
    LSM6DS3TR_C_RES_RATIO_2_14  = 3,
    LSM6DS3TR_C_RES_RATIO_ND    = 4,    /* ERROR CODE */
} lsm6ds3tr_c_rr_t;
int32_t lsm6ds3tr_c_sh_sync_sens_ratio_set(const stmdev_ctx_t *ctx,
        lsm6ds3tr_c_rr_t val);
int32_t lsm6ds3tr_c_sh_sync_sens_ratio_get(const stmdev_ctx_t *ctx,
        lsm6ds3tr_c_rr_t *val);

int32_t lsm6ds3tr_c_sh_master_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6ds3tr_c_sh_master_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6ds3tr_c_sh_pass_through_set(const stmdev_ctx_t *ctx,
                                        uint8_t val);
int32_t lsm6ds3tr_c_sh_pass_through_get(const stmdev_ctx_t *ctx,
                                        uint8_t *val);

typedef enum
{
    LSM6DS3TR_C_EXT_PULL_UP       = 0,
    LSM6DS3TR_C_INTERNAL_PULL_UP  = 1,
    LSM6DS3TR_C_SH_PIN_MODE       = 2,    /* ERROR CODE */
} lsm6ds3tr_c_pull_up_en_t;
int32_t lsm6ds3tr_c_sh_pin_mode_set(const stmdev_ctx_t *ctx,
                                    lsm6ds3tr_c_pull_up_en_t val);
int32_t lsm6ds3tr_c_sh_pin_mode_get(const stmdev_ctx_t *ctx,
                                    lsm6ds3tr_c_pull_up_en_t *val);

typedef enum
{
    LSM6DS3TR_C_XL_GY_DRDY        = 0,
    LSM6DS3TR_C_EXT_ON_INT2_PIN   = 1,
    LSM6DS3TR_C_SH_SYNCRO_ND      = 2,    /* ERROR CODE */
} lsm6ds3tr_c_start_config_t;
int32_t lsm6ds3tr_c_sh_syncro_mode_set(const stmdev_ctx_t *ctx,
                                       lsm6ds3tr_c_start_config_t val);
int32_t lsm6ds3tr_c_sh_syncro_mode_get(const stmdev_ctx_t *ctx,
                                       lsm6ds3tr_c_start_config_t *val);

int32_t lsm6ds3tr_c_sh_drdy_on_int1_set(const stmdev_ctx_t *ctx,
                                        uint8_t val);
int32_t lsm6ds3tr_c_sh_drdy_on_int1_get(const stmdev_ctx_t *ctx,
                                        uint8_t *val);

typedef struct
{
    lsm6ds3tr_c_sensorhub1_reg_t   sh_byte_1;
    lsm6ds3tr_c_sensorhub2_reg_t   sh_byte_2;
    lsm6ds3tr_c_sensorhub3_reg_t   sh_byte_3;
    lsm6ds3tr_c_sensorhub4_reg_t   sh_byte_4;
    lsm6ds3tr_c_sensorhub5_reg_t   sh_byte_5;
    lsm6ds3tr_c_sensorhub6_reg_t   sh_byte_6;
    lsm6ds3tr_c_sensorhub7_reg_t   sh_byte_7;
    lsm6ds3tr_c_sensorhub8_reg_t   sh_byte_8;
    lsm6ds3tr_c_sensorhub9_reg_t   sh_byte_9;
    lsm6ds3tr_c_sensorhub10_reg_t  sh_byte_10;
    lsm6ds3tr_c_sensorhub11_reg_t  sh_byte_11;
    lsm6ds3tr_c_sensorhub12_reg_t  sh_byte_12;
    lsm6ds3tr_c_sensorhub13_reg_t  sh_byte_13;
    lsm6ds3tr_c_sensorhub14_reg_t  sh_byte_14;
    lsm6ds3tr_c_sensorhub15_reg_t  sh_byte_15;
    lsm6ds3tr_c_sensorhub16_reg_t  sh_byte_16;
    lsm6ds3tr_c_sensorhub17_reg_t  sh_byte_17;
    lsm6ds3tr_c_sensorhub18_reg_t  sh_byte_18;
} lsm6ds3tr_c_emb_sh_read_t;
