RT-Thread-Studio/sdk-bsp-psoc_e84-edgi-talk/projects/Edgi_Talk_M55_Driver_All/packages/lsm6ds3tr/lsm6ds3tr-c_reg.h
int32_t lsm6ds3tr_c_sh_read_data_raw_get(const stmdev_ctx_t *ctx,
        lsm6ds3tr_c_emb_sh_read_t *val);

int32_t lsm6ds3tr_c_sh_cmd_sens_sync_set(const stmdev_ctx_t *ctx,
        uint8_t val);
int32_t lsm6ds3tr_c_sh_cmd_sens_sync_get(const stmdev_ctx_t *ctx,
        uint8_t *val);

int32_t lsm6ds3tr_c_sh_spi_sync_error_set(const stmdev_ctx_t *ctx,
        uint8_t val);
int32_t lsm6ds3tr_c_sh_spi_sync_error_get(const stmdev_ctx_t *ctx,
        uint8_t *val);

typedef enum
{
    LSM6DS3TR_C_SLV_0        = 0,
    LSM6DS3TR_C_SLV_0_1      = 1,
    LSM6DS3TR_C_SLV_0_1_2    = 2,
    LSM6DS3TR_C_SLV_0_1_2_3  = 3,
    LSM6DS3TR_C_SLV_EN_ND    = 4,    /* ERROR CODE */
} lsm6ds3tr_c_aux_sens_on_t;
int32_t lsm6ds3tr_c_sh_num_of_dev_connected_set(const stmdev_ctx_t *ctx,
        lsm6ds3tr_c_aux_sens_on_t val);
int32_t lsm6ds3tr_c_sh_num_of_dev_connected_get(const stmdev_ctx_t *ctx,
        lsm6ds3tr_c_aux_sens_on_t *val);

typedef struct
{
    uint8_t   slv0_add;
    uint8_t   slv0_subadd;
    uint8_t   slv0_data;
} lsm6ds3tr_c_sh_cfg_write_t;
int32_t lsm6ds3tr_c_sh_cfg_write(const stmdev_ctx_t *ctx,
                                 lsm6ds3tr_c_sh_cfg_write_t *val);

typedef struct
{
    uint8_t   slv_add;
    uint8_t   slv_subadd;
    uint8_t   slv_len;
} lsm6ds3tr_c_sh_cfg_read_t;
int32_t lsm6ds3tr_c_sh_slv0_cfg_read(const stmdev_ctx_t *ctx,
                                     lsm6ds3tr_c_sh_cfg_read_t *val);
int32_t lsm6ds3tr_c_sh_slv1_cfg_read(const stmdev_ctx_t *ctx,
                                     lsm6ds3tr_c_sh_cfg_read_t *val);
int32_t lsm6ds3tr_c_sh_slv2_cfg_read(const stmdev_ctx_t *ctx,
                                     lsm6ds3tr_c_sh_cfg_read_t *val);
int32_t lsm6ds3tr_c_sh_slv3_cfg_read(const stmdev_ctx_t *ctx,
                                     lsm6ds3tr_c_sh_cfg_read_t *val);

typedef enum
{
    LSM6DS3TR_C_SL0_NO_DEC   = 0,
    LSM6DS3TR_C_SL0_DEC_2    = 1,
    LSM6DS3TR_C_SL0_DEC_4    = 2,
    LSM6DS3TR_C_SL0_DEC_8    = 3,
    LSM6DS3TR_C_SL0_DEC_ND   = 4,    /* ERROR CODE */
} lsm6ds3tr_c_slave0_rate_t;
int32_t lsm6ds3tr_c_sh_slave_0_dec_set(const stmdev_ctx_t *ctx,
                                       lsm6ds3tr_c_slave0_rate_t val);
int32_t lsm6ds3tr_c_sh_slave_0_dec_get(const stmdev_ctx_t *ctx,
                                       lsm6ds3tr_c_slave0_rate_t *val);

typedef enum
{
    LSM6DS3TR_C_EACH_SH_CYCLE     = 0,
    LSM6DS3TR_C_ONLY_FIRST_CYCLE  = 1,
    LSM6DS3TR_C_SH_WR_MODE_ND     = 2,    /* ERROR CODE */
} lsm6ds3tr_c_write_once_t;
int32_t lsm6ds3tr_c_sh_write_mode_set(const stmdev_ctx_t *ctx,
                                      lsm6ds3tr_c_write_once_t val);
int32_t lsm6ds3tr_c_sh_write_mode_get(const stmdev_ctx_t *ctx,
                                      lsm6ds3tr_c_write_once_t *val);

typedef enum
{
    LSM6DS3TR_C_SL1_NO_DEC   = 0,
    LSM6DS3TR_C_SL1_DEC_2    = 1,
    LSM6DS3TR_C_SL1_DEC_4    = 2,
    LSM6DS3TR_C_SL1_DEC_8    = 3,
    LSM6DS3TR_C_SL1_DEC_ND   = 4,    /* ERROR CODE */
} lsm6ds3tr_c_slave1_rate_t;
int32_t lsm6ds3tr_c_sh_slave_1_dec_set(const stmdev_ctx_t *ctx,
                                       lsm6ds3tr_c_slave1_rate_t val);
int32_t lsm6ds3tr_c_sh_slave_1_dec_get(const stmdev_ctx_t *ctx,
                                       lsm6ds3tr_c_slave1_rate_t *val);

typedef enum
{
    LSM6DS3TR_C_SL2_NO_DEC  = 0,
    LSM6DS3TR_C_SL2_DEC_2   = 1,
    LSM6DS3TR_C_SL2_DEC_4   = 2,
    LSM6DS3TR_C_SL2_DEC_8   = 3,
    LSM6DS3TR_C_SL2_DEC_ND  = 4,    /* ERROR CODE */
} lsm6ds3tr_c_slave2_rate_t;
int32_t lsm6ds3tr_c_sh_slave_2_dec_set(const stmdev_ctx_t *ctx,
                                       lsm6ds3tr_c_slave2_rate_t val);
int32_t lsm6ds3tr_c_sh_slave_2_dec_get(const stmdev_ctx_t *ctx,
                                       lsm6ds3tr_c_slave2_rate_t *val);

typedef enum
{
    LSM6DS3TR_C_SL3_NO_DEC  = 0,
    LSM6DS3TR_C_SL3_DEC_2   = 1,
    LSM6DS3TR_C_SL3_DEC_4   = 2,
    LSM6DS3TR_C_SL3_DEC_8   = 3,
    LSM6DS3TR_C_SL3_DEC_ND  = 4,    /* ERROR CODE */
} lsm6ds3tr_c_slave3_rate_t;
int32_t lsm6ds3tr_c_sh_slave_3_dec_set(const stmdev_ctx_t *ctx,
                                       lsm6ds3tr_c_slave3_rate_t val);
int32_t lsm6ds3tr_c_sh_slave_3_dec_get(const stmdev_ctx_t *ctx,
                                       lsm6ds3tr_c_slave3_rate_t *val);

/**
  * @}
  *
  */

#ifdef __cplusplus
}
#endif

#endif /* LSM6DS3TR_C_DRIVER_H */
